{
	"PortsDescriptions": [{
			"name": "Adelaide",
			"country": "Australia",
			"description": "The Port of Adelaide covers an Inner and Outer Harbor and contains more than 20 wharves. During the 2006-2007 year, over 10 million tons of cargo passed through the Port of Adelaide, including 5.6 million tons of overseas imports and exports. Petroleum imports increased to 2.2 million tons in the same period. The Port of Adelaide’s primary export destinations are the Middle East and Asia, while its primary import partners are the United States and North and Southeast Asia. The principal commodities handled in the Port of Adelaide include grains and seeds, limestone, petroleum and petroleum products, motor vehicles, containers, metals, cement, fertilizers, logs, iron and steel, breakbulk and general cargoes, mineral sands and concentrates, livestock, and agricultural commodities. The Port of Adelaide’s Inner Harbor handles roll-on/roll-off and bulk cargoes that include meat, grains, fruit, wool, malt, soda ash, cement clinker, iron and steel scrap, non-ferrous metals, tallow, and a wide range of manufactured goods. The Inner Harbor has modern facilities for the import of timber, refined petroleum, sulphur, fertilizer, paper products, iron and steel, and motor vehicles. The Outer Harbor contains six berths equipped to handle specialized cargoes including motor vehicles, roll-on/roll-off and general cargo, and livestock. The Adelaide Container Terminal in the Outer Harbor is an efficient state-of-the-art facility for container cargo. The Outer Harbor contains intermodal facilities to integrate the container terminal with the country’s rail and road networks. The Port of Adelaide Container Terminal, located at Berths 6 and 7, has capacity to handle 250 thousand lifts per year at a quay of 510 meters. The terminal covers 23 hectares and has warehouse space of 3000 square meters on dock. It has 11 forklifts and reefer plugs as well as a roll-on/roll-off quarter ramp. The terminal is served by two dual-gauge rail tracks linked directly with the national rail network."
		},
		{
			"name": "Botany Bay",
			"country": "Australia",
			"description": "Sydney Ports Corporation manages Port Botany, and Port Botany facilities handle about 70% of Sydney Ports Corporations total trade throughput. The facilities at Port Botany include two container terminals with six berths for container vessels and a bulk liquids berth. The channel leading to the 205-hectare Port Botany area is 213 meters wide with a minimum depth of 15 meters. The swinging basin at Brotherson Dock is dredged to 14.4 meters."
		},
		{
			"name": "Brisbane",
			"country": "Australia",
			"description": "The Port of Brisbane contains 27 berths with a total length of more than 7.7 meters at both the Port of Brisbane main location and at upriver facilities. The Port of Brisbane includes six berths that handle containers, five berths for oil, and five for general cargo and motor vehicles. The Port of Brisbane also contains two berths handling chemicals and fertilizers, two for liquid bulk cargoes, and two fit-out berths at the Forgacs Cairncross docks. The Port of Brisbane contains one berth for each of the following cargoes: grain, woodchips, and cottonseed; grain, dry bulk, and general cargo; clinker; coal and clinker; sugar, and cruise vessels. The Port of Brisbane's container terminals have six berths with a total length of 1437 meters. The terminals are leased by two national stevedoring firms. DP World Brisbane operates Berths 4 through 6 with ample cargo-handling equipment that includes several Panamax, post-Panamax, and super post-Panamax gantry cranes. Patrick operates Berths 7 through 9. The Port of Brisbane Corporation owns the wharves and provides for the majority of fixed improvements at the container terminals. The Port of Brisbane's general cargo wharves have a total length of 697 meters, and they handle breakbulk and roll-on/roll-off cargoes, containers, and motor vehicles. AAT leases and manages the Berths 1 through 3 and manages the receipt and delivery of cargoes. The grain berth at the general cargo wharves has been extended by 50 meters in order to serve pure car carrier vessels when needed."
		},
		{
			"name": "Darwin",
			"country": "Australia",
			"description": "Port Darwin’s facilities can accommodate the full range of cargoes. The Iron Ore Wharf has a berth 142 meters long with east and west mooring dolphin and alongside depth of 11.8 meters. The concrete-decked Fort Hill Wharf is 300 meters long and has multi-user berths with a depth of 11 meters. It includes a high-capacity floating roll-on/roll-off linkspan. Fort Hill East is a 150-meter berth with 10-meter depth and additional deck-loading capacity. The Roll-on/roll-off linkspan at the western end of the wharf can handle 45-ton loads from vessels of any size or type. Port Darwin’s Stokes Hill Wharf is concrete decked with multi-user berths used by cruise ships, charter vessels, naval vessels, oil rig tender vessels, and the fishing and pearling fleet. The wharf has total berth length of 292 meters and alongside depth of 9 meters. The Inner Stokes Hill Wharf can handle vessels up to 70 meters, such as research vessels, prawn trawlers, pleasure boats, and tug. It offers 280 meters of berth and low-water depth of 4.5 meters. The Stokes Hill Wharfs are equipped with power, water, and fuel outlets. The Darwin Fishing Harbor and Mooring Basin in Frances Bay offers sheltered moorings for the fishing fleet and supply and repair facilities. Protected from the tide, the basin is dredged and offers 85 berths as well as showers, toilets, and public phones. Fisherman's Wharf offers a piled wharf of 200 meters. The wharf is dredged and can accommodate as many as 18 30-meter vessels. It is equipped with shore power, fresh water, telephone service, public toilets and showers, and fuel supplies."
		},
		{
			"name": "Fremantle",
			"country": "Australia",
			"description": "Fremantle Port covers about 155 hectares of land in the Inner Harbor and 57 hectares in the Outer Harbor. The Inner Harbor includes Victoria Quay, North Quay, and the Rous Head Industrial Park. The largest, North Quay, contains two container terminals and several general cargo berths used for breakbulk and liquid bulk cargoes. North Quay also has 811 meters of common-user wharf with four heavy-duty berths with a depth of 11 meters and good road access. Both Fremantle’s North Quay and the Kwinana Quay are linked by rail to the country’s rail networks."
		},
		{
			"name": "Geelong",
			"country": "Australia",
			"description": "Geelong Port is governed by Victorian Regional Channels Authority, and the Victorian Ports manages Geelong Port and Western Port (near Melbourne).Geelong Port manages 14 berths in the port and about 90 hectares of land. GrainCorp provides storage, logistics, and marketing of grain and free-flowing commodities like wood chips, minerals, fertilizers, stock feed pellets, and clinker cement. The pier at Geelong Port’s Point Wilson is 168 meters long with alongside depth of 12.3 meters and two mooring dolphins. The facility at Point Wilson handles only dangerous and explosive cargoes. Refinery Pier Berth 1 is about 213 meters long with alongside depth of 12.3 meters and four inshore mooring dolphins. Refinery Pier Berth 2 is about 213 meters long with alongside depth of 12.3 meters and three inshore mooring dolphins. Refinery Pier Berth 3 is about 275 meters long with alongside depth of 12.3 meters and two inshore mooring dolphins. Refinery Pier Bert 4 is 275 meters long with alongside depth of 12.3 meters and two mooring dolphins. The wharf for Geelong Port’s Lascelles Berth 1 is 185 meters long and 17 meters wide. It has alongside depth of 12.3 meters and two mooring dolphins. Its equipment includes an acid receival system. Lascelles Berths 2 and 3 are 436 meters and 30 meters wide with alongside depth of 12.3 meters. The self-discharge facility has cargo receival capacity for 3000 tons per hour, and it is equipped with a truck loading facility. The Lascelles Berth 1 has a storage shed covering 8500 square meters, including three cargo storage bays with overhead feed conveyor system. Berth 2 has a 6900 square meter storage shed with three cargo storage bays with overhead feed conveyor system. Storage sheds on both Berth 1 and 2 are for the exclusive use of Incitec Pivot Fertilizers."
		},
		{
			"name": "Gladstone",
			"country": "Australia",
			"description": "The Port of Gladstone’s Container Terminal was designed for containerized, breakbulk, and general cargo. Its facilities include a 2100-square meter storage shed, 1.5 hectares for general storage, 3.5 hectares for heavy storage, and direct rail access. The wharf at the Gladstone Container Terminal is 172 meters long with a berth depth of 11.3 meters."
		},
		{
			"name": "Melbourne",
			"country": "Australia",
			"description": "The Port of Melbourne contains 34 commercial berths distributed among river wharves, five docks, Station Pier, and the Gellibrand Pier at Williamstown. The Port of Melbourne contains two international container terminals and multi-purpose berths that handle a variety of cargoes that include timber and vehicles. The Port of Melbourne is the largest container and general cargo port in Australia. Some 3200 ships call at the Port of Melbourne each year. The port handles about 38% of the container trade in the country, serving 42 container shipping lines and many general cargo carriers. Services in the Port of Melbourne are provided through long-term leases between private sector companies and the Port of Melbourne Corporation. The Port of Melbourne's Swanson Dock East is operated by Patrick Container Ports (Patrick) on a 24-hour, seven-days-per-week basis. Covering 40 hectares and containing four berths, the Swanson Dock East is 885 meters (2903.5 feet) long with maximum alongside depth of 13.1 meters (43 feet) and maximum draught of 12.1 meters (39.7 feet). This Port of Melbourne facility is equipped with eight cranes, including three post-Panamax cranes. These include one 80-ton, two 70-ton, one 50-ton, and four 45-ton cranes. The terminal also has 42 straddle carriers. The Port of Melbourne's Swanson Dock East terminal has capacity to store 6500 TEUs, and it has 1004 reefer plugs. It has rail sidings totaling 640 meters (2100 feet) with capacity for 189 TEUs."
		},
		{
			"name": "Newcastle",
			"country": "Australia",
			"description": "Newcastle Port Corporation manages and operates the Port of Newcastle, which has a solid infrastructure to handle a wide variety of cargos. Most of the trade through the port is bulk cargo (coal), but the Port contains ample facilities to handle general and breakbulk cargo and containers. The Port of Newcastle’s infrastructure includes coal terminals, a bulk liquid terminal, storage facilities, and connections with local and national rail systems. The Port of Newcastle’s basin area is the site of general cargo handling, including containers, breakbulk, grain, and the port’s ship repair facilities. The Eastern Basin handles general cargoes that include aluminum, steel, and timber. All berths in this group have a draft of 11.6 meters. Eastern Basin No. 1 has a four-hectare area for stacking general cargo and a 7120 square meter warehouse. Eastern Basin No. 2 shares facilities with No. 1. Western Basin No. 3 contains a grain berth and storage silos with capacity for 157 thousand tons. Western Basin No. 4 is equipped with a heavy-duty berth for general and project cargo and has backup storage area of 1.5 hectares."
		},
		{
			"name": "Kembla",
			"country": "Australia",
			"description": "Although Port Kembla has traditionally been a port for handling bulk cargoes like iron ore, grain, and coal, it is undergoing major expansions to add general, breakbulk, and containerized cargoes. It has an advantage, being the closest port to southwest Sydney. The Australian Amalgamated Terminals is a multi-user facility providing facilities and support for the stevedoring industry. The Port Kembla facility offers three berths and is adding a fourth berth and wharf extension. The terminal area has a 15 thousand square meter storage building and two 2200 square meter sheds for containers, breakbulk, and vehicles."
		},
		{
			"name": "Sydney",
			"country": "Australia",
			"description": "The Port of Sydney enjoys one of the most beautiful harbors in the world. The harbor supports both commercial shipping and recreational boating. The Port of Sydney's commercial wharves are less than ten kilometers (six miles) from the international shipping lanes. Its 11 berths handle the full range of commercial vessels handling containers, dry bulk, liquid bulk, general cargo, and cruises. Port of Sydney facilities cover a total area of 41.7 hectares, with port facilities located at Glebe Island/White Bay, Circular Quay, and Walsh Bay. There are also private facilities at Gore Cove in the Port of Sydney. As a popular cruise destination, the Port of Sydney is the only port in Australia with two dedicated cruise terminals."
		},
		{
			"name": "Port Vila",
			"country": "Vanuatu",
			"description": "The Port Vila Port Authority governs the Port of Port Vila. The seaport offers a deep-water anchorage in the horseshoe-shaped Vila Bay on the southwestern shores of the island of Efate. As the country's major port, the Port of Port Vila's proximity to Australia has encouraged its development as a tourist center. The Port of Port Vila is a popular stopping point for yachts and large recreational vehicles. The Port of Port Vila is a deep-water port and visiting yachts would often have to anchor in 30-40 meters of water or tie to the seawall. What's more, the bottom of the protected inner harbor has a black mud bottom that for some reason eats the galvanizing off chain in record time. Not to mention the fragments of old wrecks that clutter the deep water and can snag an anchor. Today, the yachting harbor has an extensive network of well-engineered and –maintained moorings that can accommodate vessels to 40 tons."
		},
		{
			"name": "Apia",
			"country": "Samoa",
			"description": "The Port of Apia is the country's only commercial port, and it handles almost all the country's foreign trade cargoes. The Port of Apia has regular maritime relationships with New Zealand and Australia in the South Pacific and with countries around the world that include Japan, the United States, and Europe. The main wharf in the Port of Apia was built in 1966 to handle conventional cargoes. The wharf is 185 meters long alongside depth of 12 meters. A new 166-meter wharf extension was added in late 2003. The Port of Apia Marina was completed in two phases. Phase I included the construction of a 50-berth facility for yachts. Phase II saw the development of a mall for lease to support customers of the marina and the addition of berths for 32 yachts. The floating restaurant is moored adjacent to the marina and offers a romantic setting with a glorious view of the ocean sunsets."
		},
		{
			"name": "Papeete",
			"country": "French Polynesia",
			"description": "The Port of Papeete contains over 2500 meters of quays, including four quays for cruise ships, three quays for cargo liners and container ships, six quays for inter-island traffic, and a quay for ferries and catamarans. The Port of Papeete also contains three oil jetties and two quays dedicated to the local fishing fleet and yachts (with capacity for 50 sailing ships). The quays for the fishing fleet are a total of 240 meters long and can accommodate about 90 large deep-sea vessels (for example, tuna boats). The Port of Papeete manages two marinas, one of the islands of Tahiti and one at Moorea. The Port of Papeete is the only international port in French Polynesia, handling over 1.9 million tons of cargo and more than 69 thousand TEUs of containerized cargo each year. The commercial wharves of the Port of Papeete total 2500 meters. One quay of 450 meters with alongside depth of 12 meters has three berthing positions for cargo liners and container ships. The Port of Papeete’s Container Terminal includes 140 thousand square meters for storage of bulk cargoes and containers. The Port of Papeete contains six quays of a total 980 meters for inter-island vessels. Furthermore, the Moorea Quay is 100 meters long and, located near the city center, has two berthing stations for ferries."
		},
		{
			"name": "Suva",
			"country": "Fiji",
			"description": "The Fiji Ports Corporation Limited (FPLC) owns and operates the Port of Suva and three other ports: Lautoka, Malau, and Vanau Levu. The FPCL is a government-owned commercial company. The Port of Suva is the largest and busiest container and general port in Fiji, and it is the country’s maritime gateway. The FPLC is responsible for managing and maintaining local wharves and property, developing, and maintaining wharf infrastructure, overseeing marine services, and providing land-based services like cargo-handling yards, warehouses, and berths. The Port of Suva contains five berth locations with a total of 845 meters of berthing space with alongside depths up to 12 meters. The container terminal offers storage capacity for 80 thousand TEUs of containerized cargo. The Port of Suva is the heart of Fiji’s ports, and Fiji is a major crossroad for shipping between Australia, New Zealand, North America, and the South Pacific region."
		},
		{
			"name": "Apra Harbour",
			"country": "Guam",
			"description": "The Port Authority of Guam (PAG) is responsible for operating the Jose D. Leon Guerrero Commercial Port. An autonomous government agency, the PAG was established in 1975. Port facilities cover about 74 acres on the Island of Cabras in Apra Harbor, which is protected by a 4.5-kilometer breakwater. The PAD owns and operates the harbor, three marinas, five cargo-handling piers, and two fuel piers in the Jose D. Leon Guerrero Commercial Port. In 2006 the Jose D. Leon Guerrero Commercial Port handled 144.2 thousand TEUs of containerized cargo. The Jose D. Leon Guerrero Commercial Port’s Pier F3 handles general cargo, fishing vessels, and passenger vessels. It is 705 meters long with alongside depth of 10.4 meters. Piers F4, F5, and F6 handle general cargo and containers. Total length of these piers is 600 meters with alongside depths from 10.4 to 11.6 meters. The Hotel Wharf at the Jose D. Leon Guerrero Commercial Port is 152.4 meters with alongside depth of 10.4 meters, and it handles passenger and fishing vessels and some general cargo. The Container Yard contains 10.7 hectares of storage yard for containers and 180 stalls equipped for reefer containers. Two Fuel Piers serve Mobil and Shell oil companies at the Jose D. Leon Guerrero Commercial Port. Serving liquid bulk tankers, the Mobil Pier is 112.8 meters long with alongside depth of 15.2 meters. The Shell Pier serves liquid bulk and liquefied petroleum gas tankers and is 167.6 meters long with alongside depth of 21.3 meters."
		},
		{
			"name": "Phnom Penh",
			"country": "Cambodia",
			"description": "The Port of Phnom Penh provides experienced operators to handle cargo and has assigned management teams to improve productivity and manage the installation and use of new equipment. The quay is equipped with two floating and two mobile cranes with capacity to handle up to 100 tons. The Port of Phnom Penh plans to add a fixed crane to increase capacity. The Port of Phnom Penh offers ample storage and warehousing facilities and professional staff who manage those facilities. Two new warehouses are being constructed near the port terminal to increase cargo handling and storage capacity."
		},
		{
			"name": "Chittagong",
			"country": "Bangladesh",
			"description": "The Port of Chittagong contains 20 berths serving ocean-going vessels, including 12 for general cargo and eight for containers. Seven specialized berths are dedicated specific bulk cargoes that include petroleum and petroleum products, grain, cement clinker, and ammonia. The Port of Chittagong also contains ten single-point river mooring berths and two dry dock jetties for vessel repairs. There are also berths for inland coasters and domestic vessels that handle petroleum products, grain, and cement, among other cargoes. The Port of Chittagong Container Terminal (CCT) has holding capacity for 6408 TEUs of containerized cargo. The CCT quay is 450 meters (1476 feet) long. The Container Freight Station at the Port of Chittagong's CCT covers 1.3 hectares, and the container storage yard covers 15 hectares. The CCT is served by rail siding of 550 meters (1804 feet)."
		},
		{
			"name": "Yangon",
			"country": "Myanmar",
			"description": "The Port of Yangon lies on the banks of the Yangon River about 32 kilometers inland from the Gulf of Martaban. Therefore, all vessels over 200 gross registered tons calling at the Port of Yangon must have pilotage. The Port of Yangon can receive vessels up to 15 thousand DWT and to 167 meters long with draft of nine meters. The Port of Thilawa can receive vessels to 20 thousand DWT and 200 meters in length. MPA operates the following wharves. Hteedan Rice Berth is 139 meters long with a 6.7 thousand square meter shed, and it handles rice and rice products. Handling general cargoes, the Sule Pagoda Wharves are a total of 1.0 thousand meters long and contain 7 berths. They have 36.8 thousand square meters of yards and 67.5 thousand square meters of sheds. Handling general cargo, the Port Health Jetty is 91 meters long and has a 4.4 thousand square meter shed. The Bo Aung Gyaw Wharves contain three berths with a total length of 457 meters, and they handle containers and general cargo. The Bo Aung Gyaw wharves also contain 60.7 thousand square meters of yards and 400 square meters of shed. The Bo Aung Gyaw Container Yard has capacity to store 2622 TEUs, including 1818 full TEUs, 750 empty TEUs, and 54 reefer TEUs. The MPA also owns and operates two container depots. Botataung No. 1 Inland Container Depot has a yard area of 39.5 thousand square meters and has capacity for 4.4 thousand TEUs of containerized cargo, including 500 full, 3872 empty, and 15 reefer TEUs. Botataung No. 2 Inland Container Depot has a 66.6 thousand square meter yard and capacity to store 2822 TEUs of containerized cargo, including 1962 full, 800 empty, and 60 reefer TEUs. Other operators in the Port of Yangon support the following wharves. Handling general cargo, Hteedan Berth is 180 meters long and has 21.7 thousand square meters of yards. The Ahlone Wharves handle containers and general cargo. With three berths at a total length of 614 meters, the Ahlone Wharves include 55.0 thousand square meters of yards and 6.1 thousand square meters of sheds. Ahlone Wharf No. 3 has capacity to store 4651 TEUs of containerized cargo. Handling containers and general cargo at the Port of Yangon, the Myanmar Industrial Port Wharves are 310 meters long and contain 102.4 thousand square meters of yards and 6.1 thousand square meters of sheds. The Thaketa Wharves have two berths with a total length of 212.4 meters. Handling general and liquid cargoes, the Port of Yangon’s MIPL Wharf is 200 meters long and has 20 thousand square meters of yards and three thousand square meters of sheds. The MITT Wharves, handling containers and general cargo, are a total of 1000 meters long and contain 500 thousand square meters of yards and 20 thousand square meters of sheds. Handling general cargo, coastal traffic, and passengers, the Port of Yangon’s Thaketa Wharves contain 16.3 thousand square meters of yards and 4.5 thousand square meters of sheds."
		},
		{
			"name": "Hong Kong",
			"country": "Hong Kong",
			"description": "The Port of Hong Kong contains almost 7.7 thousand meters of quays at the Kwai Chung and Stonecutters terminals, about 7.0 thousand meters (22.9 thousand feet) of quays at public cargo working areas. Three public passenger ferry terminals serve over 20 million passengers per year traveling to and from mainland China and Macau. Kwai Tsing Container Terminals in the northwestern area of the Port of Hong Kong harbor contain nine container terminals with 24 berths that total about 8.5 thousand meters (27.9 thousand feet) in length. The Port of Hong Kong container terminal area of 217 hectares includes container yards and container freight stations. Planning is ongoing for a new Container Terminal 10 which would likely be located Tsing Yi or Lantau. The Pilotage Authority for the Port of Hong Kong is the Director of the Marine Department. Pilotage is required for ships of three thousand gross tons and above. In addition, immigration and quarantine facilities are available 24 hours a day. The Port of Hong Kong contains ample facilities for the repair, maintenance, dry-dock, and slipping of vessels. There are two floating dry docks off Tsing Yi Island, the largest with capacity to dock vessels to 150 thousand metric tons DWT. There are many smaller shipyards throughout the Port of Hong Kong that repair vessels and build specialized craft. The Marine Department operates 58 mooring buoys in the Port of Hong Kong dedicated to ocean-going vessels. Of these Port of Hong Kong buoys, 31can accommodate ships to 183 meters (600 feet) long, and the remaining 26 buoys can serve vessels to 137 meters (449.5 feet) long. Forty-four special mooring buoys are typhoon moorings where ships can safely moor during tropical cyclones. The Marine Department maintains three immigration and quarantine anchorages, eight dangerous goods anchorages, and eight general purpose anchorages to provide temporary berthing space. Supporting the transfer of cargoes between vessels and shore and to and from Pearl River ports, the Marine Department manages about 6.7 thousand meters of public cargo working areas throughout the Port of Hong Kong. The Port of Hong Kong maintains more than 460 marine navigation aids throughout the port. The Port of Hong Kong provides navigation aids through the Navigation and Mooring Unit. The Unit maintains 540 aids that include 120 lighted buoys and 420 lighted beacons. To use more renewable energy in the Port of Hong Kong, about 90% of the battery-operated navigation aids are powered by solar energy."
		},
		{
			"name": "Colombo",
			"country": "Sri Lanka",
			"description": "The Port of Colombo’s Jaya Container Terminals are located at the western and northern entrances to the port. They cover 130 hectares of land and 70 hectares of water surface. They contain four main berths and two feeder berths. The quays are a total of 1292 meters long with an additional 350 meters of feeder berth quay at dredged depths ranging from 12 to 15 meters. The quays are equipped with Panamax and Super Post-Panamax quayside container cranes and rail-mounted gantry cranes. The Jaya container terminal areas in the Port of Colombo cover 45.5 hectares and contain stacking capacity for 44.1 thousand TEUs of dry containers and 1.5 TEUs of reefer containers. The Container Freight Station area covers 15 thousand square meters. State-of-the-art computer systems maintain effective and efficient management practices and real-time yard use planning and operations. The Port of Colombo’s Unity Container Terminal has two container berths and one multi-purpose berth dredged to depths from 9 to 11 meters. The terminal has 590 meters of quay and 1.5 hectares of container terminal area with stacking capacity for 8 thousand TEUs. The terminal is equipped with three quayside container cranes and 50 terminal tractors. The South Asia Gateway Terminals at the Port of Colombo have a total of 940 meters of berths with alongside depth of 15 meters. The terminal covers 20 hectares of total area and offers 12 hectares of stacking area, including 540 reefer slots with capacity for 1620 TEUs. The Port of Colombo offers a total of 6245 square meters of bonded warehouse including 125 square meters of cool room. These warehouses are equipped to accept all types of goods except dangerous or perishable goods. Twenty-four-hour security service is provided, and small processing services for re-export cargoes are available at Warehouse BQII. The Port of Colombo South Harbor Development Project is planned to be located west of the current southwest breakwater. Covering about 600 hectares, the new development will contain four terminals, each over 1200 meters long with alongside depths of 18 meters. In the future, the Port of Colombo may deepen the berths to 23 meters for deep-draft vessels. The South Harbor channel will be 560 meters long with a depth of 20 meters and a harbor basin depth of 18 meters with a 600-meter turning circle."
		},
		{
			"name": "Bedi Bunder",
			"country": "India",
			"description": "The anchorage at the Port of Bedi Bunder is 11 kilometers away from the port. The port is equipped to accommodate up to 17 vessels at one time from October to June and 13 vessels at once during monsoon season from June to October. Ships can request pilot services from the Pirotan lighthouse to the Rozi anchorage about seven miles from the Port of Bedi Bunder."
		},
		{
			"name": "Chennai",
			"country": "India",
			"description": "The Port of Chennai has three docks with 24 berths at depths ranging from 12 to 16.5 meters (39.4 to 54.1 feet). The Port of Chennai's long-term plan focuses on the 4 Cs: containers, cars, cruises, and clean cargo. The master plan for the Port of Chennai calls for realigning the rail and road network, creating a dedicated elevated expressway from the Port of Chennai to Maduravoyal, an outlying township that links the port to the country's highway and rail networks. Future plans also include the construction of a new roll-on/roll-off terminal and a multi-level car parking facility with capacity for five thousand cars. The Port of Chennai's breakwater will be extended to develop a deep-draft oil berth for the largest crude carriers. The Port of Chennai covers a total of 237.5 hectares of land area and almost 170 hectares of water area. The entrance channel to the Port of Chennai is about seven kilometers (4.3 miles) long with a depth of 19.2 meters (63 feet) at the outer channel and 18.6 meters (61 feet) at the inner channel. Channel width is generally 305 meters (1000 feet). The Inner Harbor contains the 1325-meter (4347-foot) Eastern Breakwater and the 575 -meter (1886-foot) Northern Breakwater. The Outer Harbor contains a 590-meter (1936-foot) Eastern Breakwater, a 460-meter (1509-foot) Northern Breakwater, a 1000-meter (3281-foot) Outer Arm, and a 950-meter (3117-foot) Upper Pitch Revetment. The Port of Chennai contains seven transit/overflow sheds covering a total area of 3.1 hectares, five warehouses covering three hectares, and three container freight stations covering 4.1 hectares. The Port of Chennai also has 38.5 hectares of open space and a 25.1-hectare container parking yard. The Port of Chennai offers ample cargo-handling equipment. The Port of Chennai has a 150-ton capacity floating crane and three 10-ton capacity mobile cranes. The Port of Chennai also has ten 3-ton diesel forklift trucks and ten high-capacity diesel forklift trucks (three 10-ton, five 15-ton, and two 25-ton). The Port of Chennai has two 3-ton payloaders and 14 diesel electric locomotives. The Coal Conveyor at the Port of Chennai is a semi-mechanized closed system with capacity for 15 million tons per year and capacity to handle 1500 tons per hour."
		},
		{
			"name": "Cochin",
			"country": "India",
			"description": "The Port of Cochin inner harbor has two navigation channels. The Ernakulam Channel is about five kilometers long with a minimum width of 200 meters, a 500-meter turning basin, and depths from 9.75 to 13.2 meters. The Port of Cochin's Mattancherry Channel is 2.6 kilometers long, about 180 meters wide, and 9.75 meters deep. Pilots are required for ships and deep-drafted vessels. The Port of Cochin has a dry dock facility available for hire. It can accommodate vessels to 58 meters long and 10.5 meters wide with draft from 3.75 to 4.2 meters. The facilities include two 5-ton capacity cranes and fire lines and shore power. The Port of Cochin's Ernakulam Wharf offers six berths with a total length of almost 1.8 thousand meters, three of which serve the container terminal. Two of the berths handle general cargo, and one is a fertilizer berth. The Ernakulam Channel also contains three oil berths. The Ernakulam Wharf in the Port of Cochin offers seven sheds covering a total area of 17 thousand square meters. The Port of Cochin container berths are each 250 meters long. Container Berths Q8 and Q9 can accommodate vessels with maximum draft of 12.5 meters up to 35 thousand DWT. The modern container terminal is operated by DP World. Container Berth Q7 is 250 meters long and can accommodate vessels with maximum draft of 10.5 meters and 20 thousand DWT. The Port of Cochin's Container Freight Station has a shed covering ten thousand square meters. The Container Freight Station has an open storage area of 20 thousand square meters and a fully mechanized stuffing/de-stuffing facility. The container stack yard contains 1300 ground slots and includes reefer points."
		},
		{
			"name": "Haldia",
			"country": "India",
			"description": "The Port of Haldia contains 15 berths with total length of 3.3 thousand meters and alongside depths from 8.5 to 11 meters. The berths include three oil jetties, four berths for coking coal, two berths for break bulk cargoes, two berths for liquid bulk cargoes, one berth for limestone, one berth for containers, one berth for coal, and one berth for both coal and general cargo. The Port of Haldia’s Berth No. 1, the Satish Samanta Oil Jetty, handles crude; petroleum, oil, and lubricants; and liquid ammonia. It can accommodate vessels to 780 feet long, and the jetty can process at least four million tons of cargo per year. Berth No. 2, the second oil jetty, handles crude and petroleum, oil, and lubricants. It can accommodate vessels to 915 feet long, and it can process at least six million tons of cargo per year. Berth No. 3 handles thermal coal; coking coal; petroleum, oil, and lubricants; and dry bulk cargoes. It can accommodate vessels to 232 meters long and can process at least 1.8 million tons of cargo per year. Berth No. 4 at the Port of Haldia can accommodate vessels to 232 meters long carrying thermal coal, and it can process at least 3.5 million tons per year. Berth No. 5 accommodates vessels to 198 meters long carrying coking coal and raw fertilizer materials. It can process at least 1.7 million tons of cargo per year. The Port of Haldia’s Berths No. 6 and 7, in the Finger Jetty, handle non-hazardous liquid bulk, dry bulk, and general cargoes. They can accommodate vessels to 213 meters long and can process a total of 400 thousand tons of cargo per year. Berth No. 8, with capacity for at least 1.3 million tons per year, handles coking coal, dry bulk, and general cargoes. Berth No. 9, with capacity for at least 270 thousand tons per year, also handles coking coal, dry bulk, and general cargoes. Within the Haldia Dock Complex, the quay for Berth 9 is 219.5 meters long with alongside depth of 13.7 meters. It includes 72.8 thousand square meters of open area and 9.3 thousand square meters of covered storage. The Port of Haldia’s container freight station at Berth 9 has 12 reefer points that can be extended."
		},
		{
			"name": "Nhava Sheva",
			"country": "India",
			"description": "The Port of Nhava Sheva is in Mumbai Harbor southeast of Elephanta Island. The Port of Nhava Sheva shares its entry channel with Mumbai Port. The common channel is some 21 kilometers (33.9 miles) and is maintained at a depth from 10.1 to 11 meters (33 to 36 feet). The channel for the Port of Nhava Sheva is 7.2 kilometers (11.6 miles) and is maintained at a depth of 11.5 meters (37.7 miles). At its entry, the channel is 350 meters (1.1 thousand feet) wide. The Port of Nhava Sheva contains 2000 meters (6.6 thousand feet) of quays for container ships and 445 meters (1.5 thousand feet) for liquid, bulk, and project cargo ships. Port of Nhava Sheva has a shallow-water berth and a port craft berth that handle feeder vessels with draught to nine meters (29.5 feet). The quay is 365.5 meters (1.2 thousand feet) long. The shallow-water berth can accommodate vessels to 30 thousand DWT, and the port craft berth can support vessels of 15 thousand DWT. Water depth at this Port of Nhava Sheva berth is maintained at from 7 to 9.5 meters (23 to 31.2 feet). "
		},
		{
			"name": "Calcutta",
			"country": "India",
			"description": "The Port of Kolkata contains two dock systems: the Kolkata Dock System located in Kolkata and the nearby oil wharves at Baj Baj and the deep-water Haldia Dock Complex which handles sea-borne trade. Both dock systems are impounded, with vessels entering and leaving the port through locks giving access to the river. The Port of Kolkata offers modern port facilities, ample storage facilities, and a sophisticated computerized container terminal. The Kolkata Dock System (KDS) includes impounded dock systems at Kidderpore and Netaji Subhas in Kolkata, petroleum wharves at Baj Baj, and anchorages at Saugor, Diamond Harbor, and Sandheads. The Port of Kolkata's Kidderpore Docks have 18 berths, six moorings/buoys, and three dry docks. The Netaji Subhas Docks have 10 berths, two moorings/buoys, and two dry docks. There are six Port of Kolkata petroleum wharves at the Baj Baj river moorings."
		},
		{
			"name": "Kandla",
			"country": "India",
			"description": "The Port of Kandla offers a huge anchorage area for vessels waiting to enter the port and for lighterage services in the outer harbor. The Port of Kandla's navigation channel is marked with 22 lighted navigational buoys, and a light house also assists navigation. The Port of Kandla offers 12 dry cargo berths with a total quay length of 2532 meters. It also operates six oil jetties, one deep-draught mooring, and four cargo moorings in the inner harbor. The Port of Kandla contains 253 hectares within its custom bonded area. The Port of Kandla is connected to its hinterland by the four-lane national highway, and it is served by a fully developed network of roads within and around the port to facilitate cargo-handling. It is also linked to the nation's rail network, and the Port of Kandla is about 17 kilometers from the Kandla Airport."
		},
		{
			"name": "Mangalore",
			"country": "India",
			"description": "The modern Port of Mangalore contains over 3.5 thousand meters of berthing space. Berths 1, 2, 3, 6, and 7 are dedicated to handling general cargo, a total of more than 900 meters long with alongside depths from 7 to 10.5 meters, can accommodate vessels from four to 30 thousand DWT. Berth 4, 198 meters long with alongside depth of 9.5 meters, handles general cargo and liquid ammonia and can accommodate vessels to 30 thousand DWT. At 198 meters long with alongside depth of 9.5 meters, Berth 5 handles general cargo and bulk cement. The deep-draft multi-purpose berth is 350 meters long with alongside depth of 14 meters and can accommodate vessels to 90 thousand DWT carrying general cargo. Berths 9, 10, 11, 12, and the Virtual Jetty are dedicated to crude oil and POL products, and they are a total of 1555 meters long with alongside depths ranging from 10.5 to 14 meters. Berth 9 can accommodate vessels to 45 thousand DWT. Berth 12 can accommodate vessels to 50 thousand DWT, and Berths 10 (the Crude Oil Jetty) and 11 can accommodate vessels to 85 thousand DWT. Handling POL products, the Virtual Jetty can accommodate vessels to 35 thousand DWT. Berth 8, the Iron Ore Berth, is 300 meters long with alongside depth of 12.5 meters and can accommodate vessels to 60 thousand DWT."
		},
		{
			"name": "Mumbai",
			"country": "India",
			"description": "The Port of Mumbai's Indira Dock contains 15 multi-purpose berths totaling 2641 meters. One berth is 183 meters long alongside depth of 7.5 meters. Four multi-purpose berths at Indira Dock are 180 meters long with alongside depths from 8.8 to 9.1 meters. Three berths are each 168 meters long alongside depth of 7.5 meters. Three multi-purpose berths are 158 meters long alongside depths from 8.8 to 9.1 meters, and five are 152 meters long alongside depths from 8.8 to 9.1 meters. The Indira Dock also contains one 152-meter-long berth for general cargo and tankers and one 130-meter-long berth for heavy lift cargoes. Each of these Port of Mumbai berths has alongside depths from 8.8 to 9.1 meters. At 244 meters long alongside depth of 9.5 meters, the Port of Mumbai's Ballard Pier Station handles containers. The Ballard Pier Extension container berth is 244 meters long alongside depth of 10 meters. The Ballard Pier Extension passenger berth is 232 meters long with alongside depth of 10 meters. The New Ferry Wharf in the Port of Mumbai contains two berths for ferries. The Ferry Jetty for passengers is 312 meters long with alongside depth of 3.2 meters. The berth for ferry ships is 249 meters long with alongside depth of 3.2 meters."
		},
		{
			"name": "Magdalla",
			"country": "India",
			"description": "The Port of Magdalla includes four jetties. Jetty No. 1, called Four Parents, is 210.8 meters long. Jetty No. 2 is 143.5 meters long. The Wharf Jetty at Dumas in 36 meters long, and the Wharf Jetty at Surat is 38.7 meters long. The Port of Magdalla operates a tugboat and a 320 Crawler mounted crane. Draft lighters with draft up to 3.5 meters operated by private parties handle containers, roll-on/roll-off, and other cargoes. The Port of Magdalla also contains storage facilities: six open plots with total area of 17 thousand square meters, four warehouses with area of 2.8 thousand square meters, and an office building."
		},
		{
			"name": "Marmagoa",
			"country": "India",
			"description": "The Port of Marmagoa has a 250-meter-wide channel that is 5.2 kilometers long in the Outer Channel and 2.3 kilometers long in the Inner Channel. Channel depths range from 13.1 to 14.4 meters."
		},
		{
			"name": "Mundra",
			"country": "India",
			"description": "As India’s largest private port, the Port of Mundra provides cargo-handling and value-added services for their customers. The multi-purpose terminals contain nine berths of a total 1.8 thousand meters long with alongside depths ranging from 9 to 16.5 meters. Berth 1 is 275 meters long with alongside depth of 15.5 meters and can accommodate vessels to 75 thousand DWT. Berth 2 is 180 meters long with alongside depth of 13 meters and can accommodate vessels to 30 thousand DWT. Accommodating vessels to 60 thousand DWT, Berths 3 and 4 are each 225 meters long; Berth 3 has alongside depth of 14 meters, and Berth 4 has alongside depth of 12 meters. Berths 5 and 6 are each 250 meters long with alongside depth of 14 meters, and both can accommodate vessels to 150 thousand DWT. Berths 7 and 8 are each 175 meters long with alongside depth of 12 meters and can accommodate vessels to 40 thousand DWT. The Barge Berth is 80 meters long with alongside depth of 6 meters and capacity for vessels of 2500 DWT."
		},
		{
			"name": "Mandvi",
			"country": "India",
			"description": "The Port of Mandvi is a fair-weather lighterage port with current capacity to handle 300 thousand tons of cargo. A 245-meter-long wharf with alongside depths from 2.5 to 3 meters is available for sailing vessels and light load vessels to load and unload. The anchorage location is about two kilometers south of the Albert Edward breakwater near the Rawal Pir Lighthouse, where the depth is ten meters. Further offshore, vessels with larger draft can anchor. The Port of Mandvi also has a 120-meter-long wharf at Ahsapura Minechem (local producer) for handling bentonite and for salt. The port maintains 16 barges for its lighterage operations and a tugboat. The Port of Mandvi contains about 780 square meters of warehouse and open storage."
		},
		{
			"name": "Navlakhi",
			"country": "India",
			"description": "The Gujarat Maritime Board is the governing authority for the Port of Navlakhi, an all-weather port with capacity to handle 900 thousand tons of cargo per year. The port offers 1.6 kilometers of anchorage at depths from 9 to 12.5 meters. To the southwest of the Nawinar Lighthouse, depths range from 10 to 12 meters. About 8 kilometers from the Port of Navlakhi, lighterage is available with a depth of 13.5 meters. Larger vessels with draft up to 16 meters can anchor at the outer reach just over 46 miles from the port, where there is a private lighter jetty with five berths of 102 meters. The Port of Navlakhi is connected by road and rail to the city of Morbi and connected to India’s railway network through Maliya."
		},
		{
			"name": "Porbandar",
			"country": "India",
			"description": "The port is protected by a 2650-meter breakwater. The Port of Porbandar offers about two kilometers of anchorage with depths from 9.5 meters at the jetties to 15 meters at the anchor points. To the southeast of the lighthouses, offshore anchorage at a depth of more than ten meters. The Port of Porbandar has a wharf for steamers of a total 385 meters long with alongside depth of 9.5 meters. The Gujarat Maritime Board controls 235 meters of that wharf, and 150 meters is controlled by private interests. The 160-meter RCC Jetty is used by India’s Navy. The port also contains a 241.2 thousand square meter dockside warehouse (go-down facility). The Port of Porbandar is connected by road and rail to the national transportation networks, and there is an airport in the city."
		},
		{
			"name": "Paradip",
			"country": "India",
			"description": "The man-made harbor of the Port of Paradip is a lagoon-type harbor with a dredged channel approach. The north breakwater is 538 meters long, and the south breakwater is 1217 meters long. The approach channels to the Port of Paradip harbor include the main approach channel (2020 meters long, 190 meters wide, and 12.9 meters deep), the entrance channel (500 meters long, 160 meters wide, and 12.9 meters deep), and the turning basin (520 meters in diameter). The Central Quay in the Port of Paradip has three berths handling general and breakbulk cargoes. The berths have a total quay length of 755 meters with alongside depth of 13 meters, and each can accommodate vessels to 230 meters long and up to 60-65 thousand DWT. The Port of Paradip's MPB Berth is 250 meters long with alongside depth of 13 meters, and it can accommodate vessels up to 190 meters long and up to 40-45 thousand DWT. The Port of Paradip's two Coal Berths are a total of 520 meters long with alongside depth of 15 meters. Handling thermal coal, the berths can accommodate vessels to 260 meters long and up to 60-75 thousand DWT. The two coal berths have capacity to handle 20 million tons of cargo per year. The Port of Paradip's South Quay berth handles petroleum, oil, and lubricant (POL) products. The berth is 265 meters long alongside depth of 12.5 meters and can accommodate vessels to 230 meters long and to 50 thousand DWT. The Oil Jetty, also handling POL products in the Port of Paradip, is 290 meters long with alongside depth of 14 meters, and it can accommodate vessels to 260 meters long and up to 65 thousand DWT. Together, the Port of Paradip's two POL berths can handle a total 7.5 million tons of cargo per year. The Port of Paradip also manages a 12.4 thousand square meter warehouse taken over from CWC with capacity for 28.4 thousand metric tons. The Port of Paradip's open stack yards covering some 150 thousand square meters of stacking area with capacity for over 2.7 million metric tons of cargo. The stacking yards have road and rail connections."
		},
		{
			"name": "Pipavav",
			"country": "India",
			"description": "The Port of Pipavav contains more than 340 meters of quays for bulk and break-bulk cargoes and 735 meters of quays for handling containers. There is also a 65-meter-long berth dedicated to vessels carrying liquefied petroleum gas. The Port of Pipavav also has ample storage space in warehouses and open stackyards and complete support service that include customs, shipping lines, and stevedore agents. Seven warehouses offer 600 square meters each, and two larger warehouses cover a total of almost seven thousand square meters. These warehouses are located near the dry cargo berths. An additional six warehouses, each covering about 6.7 thousand square meters, are located in the warehousing zone about five kilometers away from the berths."
		},
		{
			"name": "Tuticorin",
			"country": "India",
			"description": "PSA Sical manages the Port of Tuticorin, which handles both cargo and cruise ships. The Port of Tuticorin boasts an artificial deep-sea harbor with protecting breakwaters of about four kilometers. The north breakwater is 4.1 thousand meters long, and the south breakwater is 3.9 thousand meters. The Port of Tuticorin’s harbor basin covers 400 hectares of water with a 2400-meter-long, 183-meter wide approach channel. The Port of Tuticorin contains 14 berthing stations with a total quay length of almost three thousand meters and alongside depths ranging from 5.85 to 10.9 meters. The Zone B berth, with a depth of three meters, can handle lighterage vessels. The Port of Tuticorin’s Berth VIII is 345 meters long with alongside depth of 10.9 meters and can accommodate vessels to 65 thousand DWT. The Port of Tuticorin’s container terminal has a 370-meter long quay with alongside depth of 10.9 meters and can accommodate vessels to 50 thousand DWT. There are also two shallow-water berths of a total length of 250 meters with alongside depth of 5.85 meters that can accommodate vessels to five thousand DWT."
		},
		{
			"name": "Visakhapatnam",
			"country": "India",
			"description": "The inner harbor of the Port of Visakhapatnam covers 100 hectares of water surface, and its 18 berths can accommodate Panamax vessels up to 45 thousand DWT that are up to 210 meters long with draft of 10.7 and 11 meters and beam of over 32 meters. The Port of Visakhapatnam's outer harbor covers 200 hectares of water surface, and its six berths can accommodate vessels up to 150 thousand DWT that are up to 280 meters long and 48 meters wide with maximum draft of 17 meters. The Port of Visakhapatnam's East Quay has a total of 1849 meters of berths. East Quay Berths 1-4 have maximum permissible draft of 10.06 meters. Berths 1-3 are each 167.6 meters long, and Berth 4 is 231 meters long. East Quay 5 is 167.6 meters long, East Quay 6 is 182.9 meters long. Both berths have maximum permissible draft of 10.21 meters. East Quay Berths 7-9 are each 255 meters long with maximum permissible draft of 11 meters. In the west side of the Inner Harbor, the West Quay has a total of 1294 meters in six berths. West Quays 1-5 all have maximum permissible beam of 32.5 meters and maximum permissible draft of 11 meters. Quay 1 is 212 meters long, Quay 2 is 226.7 meters long, Quay 3 is 201.1 meters long, Quay 4 is 243 meters long, and Quay 5 is 241.7 meters long. RE WQ-1 berth in the inner harbor is 170 meters long and has maximum permissible beam of 25 meters and maximum permissible draft of 8 meters. The Port of Visakhapatnam's Northwestern Arm in the Inner Harbor contains three berths. The fertilizer berth is 173.1 meters long with maximum permissible beam of 32.5 meters and maximum permissible draft of 10.06 meters. The two Oil Refinery berths are each 183 meters long with maximum permissible draft of 32.5 meters. Oil Refinery Berth 1 has maximum permissible draft of 10.06 meters, and Oil Refinery Berth 2 has maximum permissible draft of 9.75 meters. The Outer Harbor in the Port of Visakhapatnam contains two Ore Berths, an Oil Mooring, a General Cargo berth, an offshore tanker terminal, a liquefied petroleum gas berth, and the container terminal. Ore Berths 1 and 2 are each 270 meters long with maximum permissible beam of 48 meters and maximum permissible draft of 16.5 meters (on a rising tide of .3 meters). The Oil Mooring is 250 meters long with maximum permissible beam of 48 meters and maximum permissible draft of 15 meters. The General Cargo Berth in the Port of Visakhapatnam's Outer Harbor is 356 meters long with maximum permissible beam of 42 meters and maximum permissible draft of 14.5 meters (on a rising tide of .5 meters). The Off-shore Tanker Terminal is 408 meters long with maximum permissible beam of 48 meters and maximum permissible draft of 17 meters (on a rising tide of .5 meters). The Liquefied Petroleum Gas berth is 370.9 meters long with maximum permissible beam of 42 meters and maximum permissible draft of 13 meters. The Port of Visakhapatnam's Container Terminal berth is 451 meters long with maximum permissible beam of 42 meters and maximum permissible draft of 14.5 meters."
		},
		{
			"name": "Veraval",
			"country": "India",
			"description": "The Port of Veraval’s anchorage is located offshore about 1.5 kilometers. Three vessels can be berthed at the same time, plus a small coaster with three meters of draft. The Landing Wharf for unloading fish contains five finger jetties of 60 meters length and five meters width. The modern Port of Veraval can accommodate 800 fishing boats comfortably; however, four thousand boats anchor there regularly."
		},
		{
			"name": "Hualien",
			"country": "Taiwan",
			"description": "Hualien Port is in the northeastern area of Hualien City. Hualien Port covers 172 hectares of land surface and over 136 hectares of water surface. Hualien Port's eastern breakwater is over four thousand meters long and includes 917 meters for the fishing port. Hualien Port's western breakwater is over one thousand meters. The access channel to Hualien Port is 240 meters wide and from 16.4 to 19.6 meters deep. The outer port turning basin has a diameter of 700 meters and a depth from 14 to 15 meters. The inner port navigation channel is 1120 meters long, and the inner port turning basin has a diameter of 200 meters and depth of 10.5 meters. Hualien Port contains 25 wharves with a total length of 4742 meters. There are 16 wharves in the inner port and nine wharves in the outer port. General goods are handled at 13 of the wharves, while gravel and minerals are handled at six wharves. Four wharves handle cement, and one wharf handles coal. Three non-service wharves in Hualien Port handle public affairs ships, guard ships, and support vessels. The inner port contains 15 warehouses, two 8-thousand-ton capacity cement silos, and a clinker silo. The outer port has two five-thousand-ton capacity cement silos. Hualien Port has 38 stacking yards overall that provide storage for minerals and gravel. The inner harbor wharves at Hualien Port are a total of 2455 meters long and handle cement, general goods, gravel, minerals, and passengers. There are also multi-functional wharves and non-cargo-handling wharves in the inner harbor. Hualien Port's Wharves 8, 10, and 13 handle cement and are a total of 587 meters in length with alongside depth of 9.5 meters and maximum permissible draft of 9.1 meters. Wharf 8 can accommodate vessels to 15 thousand DWT, while Wharves 10 and 13 can accommodate vessels to 12 thousand DWT. The nine wharves in the outer harbor of Hualien Port are a total of 2287 meters long and handle cement, general goods, sand and gravel, and oil. There is also a multi-functional wharf in the outer harbor. Hualien Port's Wharf 19 handles general goods and oil. It is 310 meters long with alongside depth of 14 meters, and it can accommodate vessels to 60 thousand DWT with maximum draft of 13 meters."
		},
		{
			"name": "Kaohsiung",
			"country": "Taiwan",
			"description": "The Port of Kaohsiung is home to 121 wharves with a total length of 27.8 thousand meters (91.2 thousand feet). There are 66 warehouses and sheds in the Port of Kaohsiung with total capacity for 957.7 thousand tons of cargo. Seven open storage yards have a total capacity of 35,322 tones or 118.3 thousand TEUs. In the Port of Kaohsiung, 27 berths totaling 5373 meters handle general merchandise and include over 117 thousand square meters of warehouse space and over 15 thousand square meters of outdoor yard. Of the 27 berths, 24 have alongside depth of 10.5 meters. One berth is 13 meters deep, one is 14 meters deep, and one is 6.5 meters deep. The Port of Kaohsiung's general merchandise berths range from 151 to 375 meters in length, with an average length of 222 meters. Three berths are 151 meters long, nine berths are from 196 to 205 meters long, two berths are 214 and 215 meters long, one berth is 298 meters long, and three berths are over 300 meters long. The Port of Kaohsiung has 11 dry bulk berths with a total length of 2350 meters, all of which have alongside depth of 10.5 meters, and more than 3.4 thousand square meters of warehouse space. Two of the Port of Kaohsiung's dry bulk wharves (at 184 and 306 meters long) handle dangerous cargo and bulk. Eight of the 11 wharves are 200 meters long, and one is 260 meters long."
		},
		{
			"name": "Keelung",
			"country": "Taiwan",
			"description": "The Port of Keelung has a total of 56 wharves with a total length of almost 10 kilometers (6.2 miles) divided between the West Coast Area and the East Coast Area. There are 26 operational wharves in the Port of Keelung's West Coast Area and 14 operational wharves in the East Coast Area. Wharves in the Port of Keelung's West Port area have total berthing distance of almost 5.4 kilometers (3.3 miles) with alongside depths from three to 14.5 meters (9.8 to 47.6 feet). Wharves in the Port of Keelung's East Port area have total berthing distance of 2.6 kilometers (1.6 miles) with alongside depths from three to 13 meters (9.8 to 42.7 feet). The Port of Keelung has 39 storage facilities covering a total of 12.8 acres with total capacity to handle 127.4 thousand tons of cargo. Operated by the Port of Keelung, seven of these facilities cover a total area of five acres and have capacity to store 24.3 thousand tons of cargo. The West Coast Area of the Port of Keelung contains five warehouses covering 3.8 acres. Warehouses 2 and 6 in the Port of Keelung's East Coast Area cover a total of 1.2 acres and have capacity to handle over 5.6 thousand tons of cargo. There are 32 storage facilities in the Port of Keelung leased by private interests. These Port of Keelung facilities cover a total of 7.8 acres and have capacity for 103 thousand tons of cargo. Y.M. Line leases a Container Freight Station at the rear of Wharves 21 to 26 in the Port of Keelung. The station covers 1.8 acres and has capacity for 8.7 thousand tons of cargo. Wharf W24 is equipped with two 40-ton gantry cranes. Port of Keelung Wharves W25 and W26 each have one 40-ton and one 50-ton gantry crane."
		},
		{
			"name": "Taichung",
			"country": "Taiwan",
			"description": "The Port of Taichung is the largest of Taiwan's four international commercial ports, covering a total area of 3793 hectares. The Port of Taichung contains 50 wharves, 16 specialized zones, and three free trade zones. The Port of Taichung's entrance channel is 350 meters (1148 feet) wide with a depth of 16 meters (52.5 feet). The North Breakwater in the Port of Taichung is 2818 meters (9245 feet), and the South Breakwater is 1397 meters (4583 feet). The Inner Channel in the Port of Taichung is 400 meters wide (1312 feet) with a depth of 16 meters (52.5 feet). The North Turning Basin in the Port of Taichung has a diameter of one thousand meters (3281 feet), and the South Basin has a diameter of 1100 meters (3609 feet). Both basins have a depth of 16 meters (52.5 feet). The Industrial Basin in the Port of Taichung is 500 meters (1640 feet) with depths from 16 to 18 meters (52.5 to 59.1 feet). The Port of Taichung's Harbor-craft Basin covers 10.3 hectares of water area with depths from 3.5 to 4.5 meters (11.5 to 14.8 feet). The Central Pier in the Harbor-craft Basin has alongside depth of seven meters (23 feet). The Fishing Port in the Port of Taichung covers 32 hectares of land and 27 hectares of water. Depths in the Fishing Port range from 3.5 to 4.5 meters (11.5 to 14.8 feet)."
		},
		{
			"name": "Madang",
			"country": "Papua New Guinea",
			"description": "The Port of Madang lies near the Gogol River on the northeastern shores of New Guinea Island on Astrolabe Bay off the Bismarck Sea in Papua New Guinea. It is the capital of Madang Province and a center for the large Gogol forest timber industry. The Port of Madang is also the distribution hub for New Guinea’s northern coast and central range. The Port of Madang exports coconuts and copra (dried coconut meat), cocoa, and coffee. The city’s main industries are processing tuna, milling timber, making the locally-popular black twist tobacco, and engineering workshops. In 2004, about 36 thousand people lived in the Port of Madang. Because the Port of Madang is thought to be safer for foreigners than the larger cities of the Port of Lae and Port Moresby, several large non-government organizations (NGOs) have offices in the Port of Madang. This also means that the city has more expatriates living and working there than other Papua New Guinea towns its size. Both the CUSO from Canada and VSO International from the UK are headquartered in the Port of Madang. Other NGOs with branch offices in the Port of Madang include Save the Children, World Vision, and the World Wildlife Federation."
		},
		{
			"name": "Moresby",
			"country": "Papua New Guinea",
			"description": "Port Moresby is the capital and largest city of Papua New Guinea (PNG). Located about 300 kilometers south of the Port of Lae (on the north coast) on the main island’s southern shores on the Gulf of Papua, Port Moresby has the highest population density of any city in the country. Growing shanty-towns and squatters’ settlements ring the outskirts of the town. In 2004, almost 338 thousand people lived in Port Moresby."
		},
		{
			"name": "Davao",
			"country": "Philippines",
			"description": "The Port of Davao is on the Philippines’ Mindanao Island at the mouth of the Davao River as it enters the Davao Gulf. Protected by Samal Island, Davao City is a regional center for Davao Region, although it is administratively independent of any province. It contains as many as 50 small commercial ports, and its major seaports are some of the busiest in the southern Philippines. The Port of Davao is a deep-water facility at Sasa about eight kilometers northeast of Davao City’s port for smaller vessels at Santa Ana. The Port of Davao handles inter-island passengers and cargoes that include copra, maize, and rice. Its international export traffic is primarily abaca, the main agricultural product in the region. Davao City and the Port of Davao are becoming the main center for tourism, business, and investment in the southern Philippines."
		},
		{
			"name": "Iloilo",
			"country": "Philippines",
			"description": "The Port of Iloilo is the independent capital of the province of Iloilo in the western Visayas region on Panay Island in the Philippines. Located in the center of the Philippine islands, the Port of Iloilo is well-positioned to be an important center for industry, commerce, and trade. It has the educational infrastructure to prepare a skilled workforce, and it has the physical city infrastructure to attract and support business and industry. Today, the Port of Iloilo’s banking, finance, retail trade, and customer service sectors are important to the local and national economy."
		},
		{
			"name": "Manila",
			"country": "Philippines",
			"description": "The Port of Manila is the capital city and chief port for the Philippines. It lies on the mouth of the Pasig River in western Luzon Island and stretches along Manila Bay's eastern shores. The Port of Manila is about 645 nautical miles southeast of the Port of Hong Kong and about 880 nautical miles east-northeast of Saigon Port. The Port of Manila is also the country's main economic, cultural, and political center. The Port of Manila has a diverse economy. In addition to housing the Philippines' major seaport, it is an important center for publishing and manufacturing. Products manufactured in the Port of Manila include textiles, chemicals, clothing, electronics, watches, leather goods, shoes, and iron and steel. Local businesses process commodities for export, including plywood, rope, refined sugar, coconut oil, and copra. The food, beverages, and tobacco sectors employ many of the city's residents."
		},
		{
			"name": "Subic Bay",
			"country": "Philippines",
			"description": "The Port of Subic Bay lies on the eastern shores of the bay off the China Sea in southwestern Luzon on the main island of the Philippines. About 82 kilometers northwest of Manila, the Port of Subic Bay is separated from Manila by the Manila Bay and the Bataan Peninsula. Before it was a commercial port, the Port of Subic Bay was occupied by the United States’ Subic Bay Naval Station, the largest in the Philippines. Mountain ranges surround Subic Bay, and the Port of Subic Bay provides a natural deep-water harbor that is protected from typhoons. The Port of Subic Bay is the country’s first free port, and it is critically important to the Philippine economy. It is home to over 700 investment projects like Hanjin Heavy Industries and Construction (Korean), the world’s fourth-largest ship-building facility. Today, the Subic Bay Port Development Project is upgrading the port to become part of the Subic-Clark Corridor based around the 45-kilometer long Subic-Clark-Tarlac Expressway. The Port of Subic Bay is becoming part of one of the most competitive international shipping services in Southeast Asia."
		},
		{
			"name": "Singapore",
			"country": "Singapore",
			"description": "The Port of Singapore is located on the southern end of the Malay Peninsula in Southeast Asia about 30 kilometers southwest of the Port of Johor in Malaysia and about 250 nautical miles north-northwest of the Port of Palembang, Indonesia. The Port of Singapore's official languages are English, Chinese, Malay, and Tamil, and most major religions are practiced in the Port of Singapore (Buddhism, Christianity, Daoism, Hinduism, and Islam). Singapore Island is less than 15 meters above sea level, and about two percent of the land is highly productive cropland. Located just 137 kilometers north of the equator, the Port of Singapore is hot and humid. The Port of Singapore has long been an important duty-free trading post for the British Empire, and it is today a major international trade center. It boasts Southeast Asia's most advanced economy, housing major finance and industry sectors."
		},
		{
			"name": "Busan",
			"country": "South Korea",
			"description": "The Port of Busan (also called Pusan) is the second largest city and the largest port in South Korea. Located at the southeastern tip of the Korean peninsula, the Port of Busan is a little over 110 nautical miles east-southeast of the Port of Kitakyushu in Japan and about 247 kilometers east of Korea's Port of Mokpo. Located at the mouth of the Naktong River, the Port of Busan lies on a deep protected bay that faces Japan's Tsushima Islands about half-way across the Korea Strait between the two countries. Connected to the mainland by a drawbridge, Yong Island divides the Port of Busan. Foreign trade is focused in the eastern port, and fishing activities are based in the Port of Busan's smaller western port. In 2007, the American Association of Port Authorities ranked the Port of Busan the tenth busiest port in terms of total tonnage and the sixth busiest in terms of 20-foot TEUs of containerized cargoes. Major industries in the Port of Busan include shipbuilding, electronics, steel, automobiles, ceramics, paper, and chemicals. New industrial parks are bringing high-tech manufacturers to the Pusan as well. In addition to ferry routes between the Port of Busan and Japanese ports, the Port of Busan is served by a major railway, the Kimhae International Airport, and express buses."
		},
		{
			"name": "Donghae",
			"country": "South Korea",
			"description": "The Port of Donghae is located on South Korea’s east central shores on the Sea of Japan in Gangwon Province. The Port of Donghae lies in mountainous terrain and is rich in natural resources, including some wonderful beaches. The Port of Donghae is a free industry zone and has seen much investment in the past years. A new cruise ferry takes passengers from the Port of Donghae to Tottori and the Port of Vladivostok in Russia and Sakaiminato in Japan. There are two ports in the province, and Mukho Harbor is about six kilometers north-northeast of the Port of Donghae. Much of the traffic that used to go to Mukho now goes to the Port of Donghae, and Mukho is primarily a fishing port."
		},
		{
			"name": "Gunsan",
			"country": "South Korea",
			"description": "The Port of Gunsan (also called Kunsan) lies on South Korea's western shores about 40 kilometers west-northwest of Jeon-ju, the Cholla-puk provincial capital. Located on the south banks of the Geum River as it enters the Yellow Sea, the Port of Gunsan is about 245 kilometers west-northwest of the Port of Busan and some 300 nautical miles east of China's Port of Qingdao. The United States Air Force maintains the Kunsan Air Base there. The Port of Gunsan is linked by rail to Iksan, and it is connected to the Seohaean Expressway. The Port of Gunsan also has a new free trade zone to encourage investment."
		},
		{
			"name": "Gwangyang",
			"country": "South Korea",
			"description": "The Port of Gwangyang is on the south-central coast of South Korea in South Jeolla Province. Just 18 kilometers north of the small Port of Yeosu, the Port of Gwangyang is about 125 kilometers west-southwest of the country's largest port, Busan, and about 160 kilometers southeast of the Port of Gunsan. Gwangyang city is home to POSCO's Gwangyang Steel Works, the world's largest facility of its kind. It's also the development center for the Gwangyang Bay Area Free Economic Zone, scheduled to be completed in 2011, when the Port of Gwangyang will focus on container-handling, shipbuilding, and steel production."
		},
		{
			"name": "Incheon",
			"country": "South Korea",
			"description": "The Port of Incheon lies at the mouth of the Han River about 40 kilometers west-southwest of Seoul, the capital of South Korea. South Korea's third largest city, the Port of Incheon is Seoul's main seaport and the site of the country's main international airport. Located almost 70 nautical miles southeast of the Port of Haeju in North Korea, the Port of Incheon is just over 30 kilometers south of the demilitarized zone between the two Koreas. It is also about 190 kilometers north of the Port of Gunsan. The Port of Incheon's industries include chemicals, salt, manufacturing, lumber, oil refining, iron and steel production, plate-glass making, and high technology. The 21st Century Port of Incheon Free Economic Zone (IFEZ) was created on reclaimed land and included a new planned high-tech city, Songdo. The IFEZ covers almost 21 thousand hectares and includes three regions: Songdo, Cheongna, and Yeongjong Island."
		},
		{
			"name": "Jeju",
			"country": "South Korea",
			"description": "The Port of Jeju (also known as Cheju Port) is located on northern Cheju Island off South Korea’s southern coast. It is the island’s biggest city, and it has the only airport. Aside from the port, its major industries are canning and the production of spirits, marine products, and starch from sweet potatoes."
		},
		{
			"name": "Masan",
			"country": "South Korea",
			"description": "The Port of Masan lies on the shores of Masan Bay some 35 nautical miles west-northwest of the Port of Busan in southeast South Korea and some 95 kilometers east-northeast of the Port of Gwangyang. The Port of Masan is the gateway between the Changwon Industrial Complex and Masan's Free Trade Zone with the rest of the world. The Port of Masan is connected to Busan by both rail and road, making it a busy market center for marine products and for produce grown in the Kimhae plain and the Namchon River valley. In addition to being a service center for its hinterland, the Port of Masan has acquired factories that produce textiles, chemicals, and machines in addition to its traditional industries of making marine products and brewing liquor."
		},
		{
			"name": "Mokpo",
			"country": "South Korea",
			"description": "The Port of Mokpo lies at the tip of the Muan Peninsula at the far southwestern end of the Korean Peninsula off the Yellow Sea (called the West Sea by Koreans). The Port of Mokpo is about 119 kilometers west-southwest of the Port of Gwangyang and 160 kilometers south of the Port of Gunsan. With more than 1400 islands within the coastal area, the Port of Mokpo enjoys rich fishing grounds, and it is the gateway to South Korea's most productive granary, the Honam Plain. The Port of Mokpo served as a navy base for many centuries and was opened to foreign trade in 1879. Connected with Seoul through Taejon by both road and rail, the Port of Mokpo is the terminal for many ferry routes serving the islands in the Yellow Sea. Its main industries are manufacturing of salt chemicals and marine products."
		},
		{
			"name": "Pohang",
			"country": "South Korea",
			"description": "The Port of Pohang is located in Kyŏngssang-puk Province in eastern South Korea. This busy port was a small fishing village before 1930 when the modern harbor when the modern harbor was constructed. Just 264 kilometers northeast of the Port of Kitakyushu in Japan, the sea offers plentiful fisheries, and the hinterlands provide agricultural products. Today, the Port of Pohang is the hub of rail, road, and sea transportation routes. Today, iron and steel producers and shipbuilders also support the local economy."
		},
		{
			"name": "Pyeongtaek",
			"country": "South Korea",
			"description": "The Port of Pyeongtaek lies at the head of the Ansong River about 23 kilometers from the Asan Bay in Gyeonggi Province in South Korea about 64 kilometers south of Seoul. The Port of Pyeongtaek is home to one of South Korea’s naval bases. It is also duty station for a large number of United States soldiers. The government of South Korea plans to make the Port of Pyeongtaek an international economic center. Coincidentally, the United States Forces Korea, are locating in the Camp Humphreys area of the Port of Pyeongtaek."
		},
		{
			"name": "Ulsan",
			"country": "South Korea",
			"description": "The Port of Ulsan lies on the southeastern shores of South Korea facing the Sea of Japan and backed by the T'aebaek-sanmaek mountains. On the shores of Ulsan Bay, the Port of Ulsan is about 50 kilometers northeast of the Port of Busan and about 60 kilometers south of the Port of Pohang. The Port of Ulsan is home to the biggest shipyard, Hyundai Heavy Industries, and the world's biggest automobile assembly plant owned by Hyundai Motors. The Port of Ulsan is also home to the SK Group operated and the world's second biggest oil refinery. Today, the Port of Ulsan is the heart of the Ulsan Industrial District, the country's special industrial area that is the corporate base for the Hyundai conglomerate. The Port of Ulsan is also home to major industrial plants, factories, and heavy industries."
		},
		{
			"name": "Bangkok",
			"country": "Thailand",
			"description": "The Port of Bangkok lies about 40 kilometers from the Gulf of Thailand on the Chao Phraya River. The Port of Bangkok is a cultural, political, and economic center for not only the country of Thailand, but for much of Southeast Asia. The Port of Bangkok is important to the local and national economies. A center for commerce, it handles large volumes of imports and exports. Industries in the Port of Bangkok produce house wares, handguns, auto parts, and antiques. While agricultural was the most important source of income for many years, the modern Port of Bangkok is an important manufacturing center producing textiles, computers, and electronics."
		},
		{
			"name": "Laem Chabang",
			"country": "Thailand",
			"description": "The Port of Laem Chabang lies on the southeastern shores of the Gulf of Thailand about 50 nautical miles south-southeast of Bangkok and about 32 nautical miles north of Thailand's Sattahip Commercial Port. The Port of Laem Chabang is the third largest port in Thailand, and it was created to take some of the burgeoning commercial traffic that was overloading the Port of Bangkok. It is also the major cruise port for Bangkok. In 2007, the American Association of Port Authorities (APPA) ranked the Port of Laem Chabang as the 21st busiest container port in the world. The local economy is based on shipping, retail, and tourism."
		},
		{
			"name": "Map Ta Phut",
			"country": "Thailand",
			"description": "The Port of Map Ta Phut is located in south central Thailand on the shores of the Gulf of Thailand about 27 kilometers east of Sattahip Commercial Port and about 150 nautical miles southeast (about 220 kilometers by road) of the Port of Bangkok. About 150 kilometers east of Thailand's border with Cambodia, the Port of Map Ta Phut is the gateway to industrial areas in southern and southeastern Thailand. The Port of Map Ta Phut is a high-volume, high-capacity industrial port serving the area's heavy industries. It is Thailand's biggest industrial port, offering one-stop services that meet the highest international standards. The Port of Map Ta Phut was established to support the government of Thailand's policy to promote investment in the country, and it is part of the country's Master Plan for the Eastern Seaboard Development Program. With this in mind, the Port of Map Ta Phut was built to accommodate a wide range of vessels, equipment, and cargoes and to boost the country's capacity for exporting. The Port of Map Ta Phut's public terminals contain terminals, warehouses, open yards, and ample equipment. The public terminals include the general cargo berth operated under a 30-year concession by Thai Prosperity Terminal Company Ltd. The liquid cargo berth is operated under a 30-year concession by Thai Tank Terminal Company Ltd. The Port of Map Ta Phut also contains dedicated terminals used by specific companies: the Rayong Bulk Terminal, the National Fertilizer Terminal, the Alliance Refining Terminal, the Maptaphut Tank Terminal, and the Glow SPP3 Terminal. The Thai Prosperity Terminal (TPT) Company Ltd operates the Port of Map Ta Phut Multipurpose Terminal serving customers in the Maptaphut Industrial Estate. TPT manages the Port of Map Ta Phut's Multipurpose Terminal as a common-use port serving international vessels and facilitating the discharge of general, bulk, and specialized cargoes and containers. The Port of Map Ta Phut Multipurpose Terminal is a modern facility that includes two berths. The main berth is 330 meters long with alongside depth of 12.5 meters, and it can accommodate vessels to 60 thousand DWT. The small vessel berth is 150 meters long with alongside depth of 6 meters. The terminal's back-up area covers 80 thousand square meters including 75 thousand square meters of open yard for general cargo, containers, heavy-lift and bulk cargoes. The warehouse of over four thousand square meters handles a variety of cargoes."
		},
		{
			"name": "Sattahip",
			"country": "Thailand",
			"description": "Sattahip Commercial Port (Thai) lies on the northern coast of the Gulf of Thailand on Sattahip Bay. Developed as a naval base in the early 1920s, it served military purposes until the late 1970s. Its deep-water port is an alternative to the Port of Bangkok's relatively shallow waters. The Port of Bangkok is about 76 nautical miles north-northwest of Sattahip Commercial Port, or about 150 kilometers by land. Sattahip Commercial Port is also about 50 kilometers south of Laem Chabang Port. Sattahip Commercial Port's Juksamet Port is one of Thailand's few deep-water ports. It is also home to the largest naval base for the Royal Thai Navy and its only aircraft carrier. Sattahip Commercial Port's Chuk Samet is the commercial port area. It contains the East and West Quays. The East Quay is 360 meters long with alongside depth of 9.14 meters. It can accommodate vessels to 150 meters long with maximum draft of 7.8 meters. The West Quay is 540 meters long with alongside depth of 9.75 meters, and it can accommodate vessels to 180 meters long with maximum draft of 9 meters. The Oil Jetty at the Sattahip Commercial Port is 198 meters long with alongside depth of 10.3 meters, and it can accommodate vessels to 27 thousand DWT. The Sattahip Commercial Port's Tung Prong is the Navy Port. It contains four deep-draft berths with a minimum depth of 18.3 meters."
		},
		{
			"name": "Da Nang",
			"country": "Vietnam",
			"description": "Da Nang Port lies at the south end of a bay off the South China Sea in east central Vietnam some 622 kilometers north-northeast of Saigon Port in Ho Chi Min City. One of the country's biggest cities, Da Nang Port has an excellent harbor enclosed to the east by the Tien Sa Peninsula and Cape Da Nang.  In addition to being one of the country's major container ports, Da Nang Port is an industrial city with a fast-growing economy. The major products produced in Da Nang Port's 4900 factories are seafood, furniture, household goods, and clothing."
		},
		{
			"name": "Saigon",
			"country": "Vietnam",
			"description": "Saigon Port serves Vietnam's biggest city and the capital of Cochincina, a French protectorate from 1862 until 1954, and of South Vietnam from 1954 until 1975. Saigon Port lies on the Song Sai Gon (Saigon) River about 80 kilometers north of the Mekong River Delta and the South China Sea. Saigon Port is Vietnam's most important economic center, accounting for a fifth of the nation's Gross Domestic Product and almost a third of its industrial production. Saigon Port industries are widely diverse and range from mining, processing seafood, agriculture, and construction to trade, industry, finance, and tourism. The local Saigon Port economy is largely dependent on the service sector and construction. Foreign investment in Saigon Port continues to increase, aimed at hi-tech activities and services. In 2007, Saigon Port received three million foreign tourists and more than 50 million metric tons of cargo."
		},
		{
			"name": "Dalian",
			"country": "China",
			"description": "The Port of Dalian includes several different port areas: Daliangang, Dalianwan, Nianyuwan, Xianglujiao, Ganjinzi, Si'ergou, Heizuizi, and Dayaowan. The state-owned Dalian Port Corporation Limited owns and manages the Port of Dalian. Located on the Yellow Sea, the Port of Dalian covers 85.5 acres (346 square kilometers) of water surface and 3.7 thousand acres (15 square kilometers) of land area. The Port of Dalian is equipped with 160 kilometers (258 miles) of railway, 74 acres (300 thousand square meters) of warehouses, almost 445 million acres (1.8 million square kilometers) of stacking yards, and more than one thousand pieces of equipment and machinery for loading/unloading cargo. The Port of Dalian contains a total of 80 berths (38 of which are deep-water berths than can accommodate vessels greater than 10 thousand DWT) handling containers, crude oil, petroleum products, grain, bulk ores, coal, and roll-on/roll-off cargoes. The Port of Dalian is home to Northeast China's biggest crude oil dock with capacity to handle 80 million tons per year."
		},
		{
			"name": "Guangzhou",
			"country": "China",
			"description": "The Port of Guangzhou is South China's biggest comprehensive hub port. The Port of Guangzhou contains 49 berths, 23 anchorages, and 13 buoys. In 1999, the Port of Guangzhou was the second busiest port in mainland China, handling 100 million tons of cargo."
		},
		{
			"name": "Huadu",
			"country": "China",
			"description": "The Port of Huadu's waterfront has 546 yards of wharf and two large warehouses with 32 thousand square feet of storage space. Huadu Harbor provides convenient access to marine transportation. It can handle 100 thousand standard containers and 850 thousand tons of bulk cargo a year. The harbor can accommodate eight cargo ships at the same time. Expansion efforts are underway, and throughput capacity will soon reach 300 thousand containers a year."
		},
		{
			"name": "Jinhzou",
			"country": "China",
			"description": "The Port of Jinzhou’s main channel is 21.5 kilometers long with a depth of 13.5 meters. It contains three anchoring zones with depth of 11 to 15 meters. Warehouses cover over a million square meters and have capacity to store over two million tons of cargo. Storage tanks have capacity for over a million cubic meters of oil and 58 thousand cubic meters of chemicals. The facility can handle over five million tons of crude oil, 4.7 million tons of refined oil, and 300 thousand chemicals per year. The Port of Jinzhou contains berths dedicated to breakbulk grocery cargoes with capacity to handle a total of 14.1 million tons per year. Railways of 16 kilometers serve the port."
		},
		{
			"name": "Jiangmen",
			"country": "China",
			"description": "Hutchison Port Holdings, a worldwide port developer and operator, manages the Jiangmen International Container Terminals have been operating since 1995. The facilities cover a total of 12.4 hectares, and berths are a total of 623 meters long with alongside depth of 4.5 meters. The Container Terminals include ten warehouses covering a total ten thousand square meters. One of the warehouses is approved as a Customs Export Supervised Warehouse. The terminal can handle dangerous cargo and reefer cargo. The Port of Jiangmen has 14 berths with at least 1000-ton capacity, and the port can handle up to 11.5 million tons of cargo. Total annual transport volume is 22.8 million tons. It contains a class-A cargo port, Xinhui Port, with warehouses of 30 thousand square meters, yards of 800 thousand square meters, and a container yard of 15 thousand square meters. The major cargoes handled at the Xinhui Port include steel scrap, chemicals, liquefied petroleum gas, asphalt, coal, sand, and clay."
		},
		{
			"name": "Nanjing",
			"country": "China",
			"description": "The Port of Nanjing has more than 300 jetties along its 200+ kilometer (over 124 miles) harbor. The Port of Nanjing contains about 230 berths, including 35 berths capable of handling ships of over ten thousand tons. The Port of Nanjing contains about 80 hectares of warehouses, and two kilometers (1.2 miles) of dedicated rail. The Port of Nanjing is home to the largest petroleum shipping jetty, coal facility, and foreign trade shipping dock of any river port in China. The Port of Nanjing contains 14 facilities on the north and south banks of the Yangtze River. These facilities include six public areas. The Xiaguan facility is a Port of Nanjing ferry terminal with 11 berths that covers 6.7 kilometers (4.2 miles) on the south bank of the Yangtze with processing capacity for over 3.1 million tons per year. The Shang Menyuan facility in the Port of Nanjing on the south bank covers 4.8 kilometers (three miles) of shoreline and contains 29 berths with total capacity for over 11.9 million tons per year. The Port of Nanjing's Xin Shengwei facility on the south bank is used to handle more than 9.7 million tons of foreign imports and automotive-related cargoes per year at its 21 berths that span 3.9 kilometers (2.4 miles) of shoreline. Also on the south bank, the Longtan facility's 32 berths in the Port of Nanjing are used primarily for the transport of containers, with capacity for more than 2.7 million tons per year. Focusing on coal transport and internal trade, the Pukou facility on the Yangtze north shore in the Port of Nanjing has 12 berths with capacity for 12.8 million tons per year. Covering 12 kilometers (7.5 miles) of shoreline on the north bank of the Yangtze River in the Port of Nanjing, the Yizheng facility has 18 berths with capacity for 27.2 million tons of petroleum per year."
		},
		{
			"name": "Ningbo",
			"country": "China",
			"description": "The Port of Ningbo offers deep water and easy currents. It is protected from strong waves and wind by the Zhoushan Islands. The entry channel for the Port of Ningbo is 22.1 meters (72.5 feet) deep in most places. Ships of up to 300 thousand tons can easily navigate the harbor with the tides. The Port of Ningbo also offers many opportunities for development and construction because it has a deep-water coastline of more than 120 kilometers (74.6 miles). Behind the deep-water coastline is a wide, flat dockland suitable for storage, warehousing, and marine industries. The Port of Ningbo has 315 working berths stretching over 50 kilometers (31 miles), including 74 deep-water berths with capacity for ten thousand DWT. The Port of Ningbo's biggest terminals include a 250 thousand DWT crude oil terminal, a 200 thousand DWT terminal for stevedoring ores that can berth ships to 300 thousand DWT, a 6th-generation international container berth, and a specialized berth for liquid chemical products with capacity for 50 thousand DWT. The container-handling facilities in the Port of Ningbo include 4465 meters (14.6 thousand feet) of berths with alongside depths from 13.5 to 17 meters (44.3 to 55.8 meters). The berths are complemented by high-capacity container yards. A single bridge crane in the Port of Ningbo can handle up to 53.3 TEUs per hour, and performance for whole ships is 364.8 TEUs per hour."
		},
		{
			"name": "Qingdao",
			"country": "China",
			"description": "The Port of Qingdao's QQCT operates eleven container berths that can support sixth-generation mega-vessels carrying more than ten thousand TEUs. This Port of Qingdao terminal covers 556 acres (2.25 million square meters) and has a minimum depth of 17.5 meters (57.4 feet). Total length of berths is 3.4 thousand meters (11.1 thousand feet), and total annual container throughput is 6.5 million TEUs. Located in Qianwan Harbor in Qingdao's Jiaozhou Bay, the depth of the route to QQCT is 15 meters (49.2 feet). The stacking yard covers an area of 225 hectares, and it includes 5,976 reefer plugs. Two new state-of-the-art 12.2-meter (40-foot) tandem quay cranes in the Port of Qingdao's QQCT can handle two 40-foot boxes or four 20-foot boxes at the same time. With the ability to serve the biggest container ships, these quay cranes have lifting height of 43 meters (141 feet), maximum outreach of 65 meters (213 feet)."
		},
		{
			"name": "Shanghai",
			"country": "China",
			"description": "The Port of Shanghai's SIPG is responsible for handling cargo; transporting domestic and international cargo by land and water; de-stuffing, maintaining, manufacturing, and leasing containers; managing information on warehousing, processing, distribution, and port logistics; providing facilities for international passengers; piloting and towing vessels; and forwarding freight; providing in-port services; leasing port equipment and facilities; and building, managing, and operating port and terminal facilities. SIPG operates 125 berths in the Port of Shanghai with a total quay length of about 20 kilometers. Of the total, 82 Port of Shanghai berths can accommodate vessels of 10 thousand DWT and above. SIPG owns public bulk, breakbulk, specialized roll-on/roll-off, and cruise terminals within the Port of Shanghai. It operates a total of 293 thousand square meters of warehouses and over 4.7 million square meters of storage yards. It also owns 5143 units of cargo-handling equipment."
		},
		{
			"name": "Taichang",
			"country": "China",
			"description": "The Port of Taicang handles containers, dry bulk cargo, and petrochemical products. The Port of Taicang contains 48 berths (24 with capacity for 10-thousand DWT vessels) and is designed to handle up to 76 million tons of cargo and 2.35 million TEUs of containerized cargo per year. The approach channel to the Port of Taicang has a navigable depth of 12.5 meters (41 feet) that can support 70-thousand DWT bulk vessels and fourth-generation container ships. At high tide, the Port of Taicang can accommodate 200-thousand-DWT bulk carriers and fifth- and sixth-generation container ships. At the end of 2008, the Port of Taicang had 15 berths serving bulk cargoes. These berths supported the Wugang Ore Terminal, the Jiulong Paper Breakbulk Terminal, the Huaneng Power Plant Coal Terminal, and the Environment-friendly Power Plant Coal Terminal. The berths total 2.6 kilometers (1.6 miles) in length and have capacity for over 44.2 million tons of bulk cargo. There are also 18 handling facilities covering a total of 15 hectares of cargo-handling yards. In 2009, four berths with total length of 791 meters (2595 feet) and capacity for an additional 3.5 million tons were added at the Wanfang Breakbulk Terminal. Two 50-thousand-DWT berths were added to support the Huangeng coal warehousing and distribution center. The total length of these berths is 570 meters (1870 feet), and they have design capacity for 24 million tons of bulk cargo. Over 900 container vessel calls come to the Port of Taicang every month. At the end of 2008, the Port of Taicang has six container berths with a total length of 1490 meters (4888 feet) designed to handle 2.35 million TEUs per year. The container berths are supported by 125 hectares of container yards, 7.5 hectares of bonded warehouses, and 2.5 hectares of warehouses for export goods under customs supervision. The supporting container-handling facilities include 16 container cranes and 47 gantry cranes. In 2009, four new 50-thousand-ton container berths were finished in the Port of Taicang, adding 1309 meters (4295 feet) of berthing space and capacity for an additional two million TEUs."
		},
		{
			"name": "Tianjin",
			"country": "China",
			"description": "The Port of Tianjin is made up of five main areas: Beijiang, Haihe, Nanjiang, Beigang, and Dongjiang. The Tianjin Lingang Industrial area is being constructed south of the Nanjiang Port Area. The Port of Tianjin covers an area of about 20 thousand hectares (200 square kilometers), including 4.7 thousand hectares (47 square kilometers) of land area. The navigation channel is 17.4 meters (57.1 feet) and can accommodate vessels to 200 thousand DWT. The Port of Tianjin contains seven major anchorages, all of which are designated for waiting for berths, quarantine, inspection, and pilotage. These anchorages offer limited shelter from rough seas and bad weather. Especially in winter, anchor-dragging is common. Because the bottom hold is poor, care should be taken in choosing anchorage spots. Located on both sides of the Port of Tianjin Main Shipping Channel, the Dagukou North, Dagukou South, and Chemical Bulk anchorages are east of the Dagu Lighthouse. They are used by most of the Port of Tianjin's traffic and can become crowded, increasing the risk of collisions. Two deep-water anchorages in the Port of Tianjin are in the deeper areas of the Bohai Bay. One of these is capable of handling very large vessels of over 150 thousand DWT. Two more anchorages are located on the south side of the Port of Tianjin's Main Shipping Channel. Anchorage 5 covers two thousand hectares and has depths from 16 to 18 meters (52.3 to 59 feet), accommodating larger vessels. Although it is not used often, the Port of Tianjin Anchorage 6 is operational and covers four thousand hectares with depths from 10 to 13 meters (32.1 to 42.7 feet)."
		},
		{
			"name": "Taizhou",
			"country": "China",
			"description": "The Yang Bay port district contains a wharf of 360 meters with alongside depth of 15 meters that can accommodate ships of to 50 thousand DWT. The High Port port district contains a 250-meter wharf with alongside depth of 11 meters that can accommodate 30-thousand-ton oil shipping vessels. The container berth is 250 meters long with alongside depth of 9.8 meters, and it can accommodate vessels up to 35 thousand DWT. The container berth includes five thousand square meters of warehouse space and an additional 13 thousand square meters of open storage. Several smaller wharves in High Port district serve vessels of 1,500 to 5,000 DWT and include a wharf for passenger steamers. The multi-purpose wharf is 130 meters long with alongside depth of 10 meters. It can accommodate vessels up to 10 thousand DWT. The first phase of the Yongan Port District contains a 270-meter wharf with alongside depth of 13 meters that can accommodate vessels up to 50 thousand DWT."
		},
		{
			"name": "Wuhan",
			"country": "China",
			"description": "Established in 1950, the Wuhan Port Transportation Head Corporation (under the Wuhan Communications National Holding Group Co. Ltd.) was charged with managing Port of Wuhan transportation, trade, industry, real estate, and cargo and passenger transport for the Port of Wuhan. The Corporation owns 200 thousand square meters, half of which have been developed, and has capacity to handle over 89 million tons of cargo per year. In 2007, over 2.6 million tons of cargo and 257 thousand TEUs of containerized cargo moved through the Port of Wuhan."
		},
		{
			"name": "Wenzhou",
			"country": "China",
			"description": "The Port of Wenzhou’s Zhuangyuanao Deep-water Port is the ideal location for a future deep-water port, with 4.4 kilometers of shoreline that will accommodate four berths for Panamax container vessels. Construction began in 2004 on this terminal occupying about 2.6 thousand square kilometers with 3 kilometers of deep-water shoreline where several berths will be constructed to handle three million TEUs per year. The project was scheduled for completion in 2007. Development of the Port of Wenzhou’s Qili Port continued to add new container berths to handle as much as 500 thousand TEUs of containerized cargo. Scheduled for completion in 2008, the Qili Port occupies about 16 hectares and has capacity to handle almost 2 million tons of cargo in 240 thousand TEUs."
		},
		{
			"name": "Xiamen",
			"country": "China",
			"description": "The Port of Xiamen contains 122 working berths, including 37 deep-water berths that host 53 international container shipping lines. Ships to 100 thousand tons can anchor in the Port of Xiamen's inner port, and ships of 50 thousand tons can enter the port for loading and unloading. The Port of Xiamen is served by a special-use railway line. The Port of Xiamen Terminal covers seven square kilometers (2.7 square miles) of land area and 300 square kilometers (116 square miles) of water surface. The longest berth at Xiamen Terminal is 350 meters (over 1.1 thousand feet) long, and the Port of Xiamen Terminal can accommodate vessels to 50 thousand DWT. The terminal includes over 10 acres of warehouse space and almost 106 acres of open yards."
		},
		{
			"name": "Yantian",
			"country": "China",
			"description": "Yantian International Container Terminals (YICT). A joint venture between the Shenzhen Yantian Port Group and Hutchison Port Holdings, the Yantian International Container Terminals is the leading Port of Yantian gateway for import and export containers traveling to the surrounding region. YICT is the Pearl River Delta's most advanced terminal. The Port of Yantian's YICT serves over 30 of the world's leading shipping lines. YICT ensures consistent outstanding performance by assuring that its operational equipment and computer systems represent the state of the art and by maintaining a highly qualified professional staff. YICT is a natural deep-water terminal with 16 berths and a 373-hectare yard. This Port of Yantian terminal's Operation Services and Development Department controls and coordinates all operations of the YICT. The Department plans, allocates, and controls vessel, truck, and container movements within the terminal. The Yantian Container Port (YCP) at the Pearl River Delta in China opened in 1994 to meet increasing export traffic from that area and from the Shenzhen Special Economic Zone. Located adjacent to Hong Kong, the deep-water facilities at the Port of Yantian Container Port range from 15 to 16 meters (49 to over 52 feet) in depth. The Port of Yantian Container Port has grown quickly, exceeding one million TEUs for the first time in 1998, just four years after opening. It is the fourth biggest container port in the world today. The Yantian Container Port is primarily an export center. Only one in ten containers moving through this Port of Yantian facility is an import container, and most of the imported containers are empty. The YCP's low production costs and export efficiency make it extremely attractive to international exporters. About half of its exports go to North America, and almost a third goes to Europe."
		},
		{
			"name": "Yantai",
			"country": "China",
			"description": "Today, the Port of Yantai contains 46 berths, including 23 deep-water berths, with alongside depths up to 16 meters. The Port has a total of 7.3 thousand meters of wharf, 95 thousand square meters of warehouses, 1.5 million square meters of storage yards, and 26 kilometers of railways."
		},
		{
			"name": "Yingkou",
			"country": "China",
			"description": "The Port of Yingkou contains more some 500 hectares of container yards and 400 hectares of logistics facilities. The Port of Yingkou includes temperature-controlled, bonded, distribution, and supervised warehouses. The Port of Yingkou is has convenient access to the Shenyang-Dalian and Harbin-Dalian highways and to China's rail network. The Port of Yingkou includes 200 hectares of ore yards and 400 hectares of coal yards. The Port of Yingkou's Bayuquan area is the fifth basin for the port. It contains berths 51 through 63, with a total quay length of 2800 meters (9186 feet) and an almost five acre closed yard enclosed with mesh fencing. The Port of Yingkou is building Berths 64 through 67, adding 1100 meters (3609 feet) of quays and 192 hectares of open yards. The Pier 63 berth in the Port of Yingkou's Bayuquan area is equipped with a 335-ton gantry crane."
		},
		{
			"name": "Zhanjiang",
			"country": "China",
			"description": "The  Port of Zhanjiang is blessed with a natural deep-water harbor, and it is the closest harbor to many international markets in Southeast Asia, Oceana, and Europe with trading relationships with over 100 countries. Guangdong Zhanjiang Harbor Limited is responsible for a production berth, 35 crude oil berths, four refined oil berths, a special-purpose berth, and two berths for wood chips. Total capacity for Guangdong Zhanjiang Harbor Limited is over 26 million tons of cargo."
		},
		{
			"name": "Abashiri",
			"country": "Japan",
			"description": "The Port of Abashiri, on the Okhotsk Sea, is located in the estuary of the Abashiri River. The port was first used in 1919; however, it did not become a practical commercial harbor until 1978. The Abashiri Port Authority is responsible for managing and operating the Port of Abashiri. Cargoes through the Port of Abashiri are those that relate to local consumption and production, particularly coastal fishing. Most recently, sight-seeing of the drift ice in winter has become a popular activity. The Port of Abashiri is currently re-developing its urban areas, including the waterfront. The port can accommodate small vessels with an inner depth of 3.5 meters."
		},
		{
			"name": "Akita",
			"country": "Japan",
			"description": "A major hub for distribution in the Japan Sea, the Port of Akita is well-equipped to handle a range of imports and exports and to support the region’s business and trade. The Port of Akita strives to work with private companies to strengthen its base for trade within Japan and with other countries in the Sea of Japan region."
		},
		{
			"name": "Aomori Ko",
			"country": "Japan",
			"description": "The Port of Aomori’s Passenger Terminal, the Shin-Chuo Wharf, is located just ten minutes by foot from the nearest rail station and 30 minutes by car from the Aomori Airport. The Shin-Chuo Wharf has two berths. One is 310 meters long with alongside depth of 10 meters, and the other is 270 meters long with alongside depth of 13 meters. In 2007, the Port of Aomori received 12 vessel calls other than the local ferry. Seven visits were made by Japanese ships, and five visits were from foreign cruise liners. The Port of Aomori is in a strong strategic position as a crossroads for trade between Japan with China, Russia, and Korea. It also has great potential to become a transportation hub between Asia and North America."
		},
		{
			"name": "Chiba",
			"country": "Japan",
			"description": "The Port of Chiba is a special major port and one of Japan's largest seaports by volume and value of the freight that passes through the port. The Port of Chiba is expanding its role as a logistics port for containers, and it already handles great volumes of liquid natural gas, crude oil, and iron ore. The Chiba Port and Harbour Office is the port authority for the Port of Chiba. The port's 133 kilometers of coastline extend over six cities from Ichikawa to Sodegaura. The Port of Chiba is mainly an industrial port, and almost all of its cargo is handled at industry-owned wharves. With further land reclamation, the Port of Chiba hopes to expand the role of the public wharves. The Port of Chiba contains 11.6 kilometers of public wharves that contain 94 berths. Lighter wharves and facilities total 6.5 thousand meters distributed among many different wharves. The Port of Chiba prefecture maintains 398.8 thousand square meters of cargo-handling areas, 15 storage sheds covering 47.2 thousand square meters, and open storage areas of 365.5 thousand square meters. The Port of Chiba also operates a waste oil treatment plan and other facilities located in Ichihara City. In the 2006 shipping season, the Port of Chiba's public wharves handled a total of 10.6 million tons of cargo carried on 15.1 thousand vessels. The public wharves in the Port of Chiba served 1403 foreign trade vessels carrying 3.7 million tons of cargo and 13.7 thousand domestic vessels carrying 6.9 million tons of cargo."
		},
		{
			"name": "Choshi",
			"country": "Japan",
			"description": "The Port of Choshi lies on the eastern tip of Chiba Prefecture in eastern Japan about four kilometers southeast of Choshi City. In 2008, Choshi City was home to over 72 thousand people. With a warm climate blessed by the Pacific Ocean, Choshi City and the Port of Choshi are also near the Tone River. The Port of Choshi was designated a refuge harbor in 1951. In 1953, Chiba Prefecture assumed management of the port. From 1965, the Port of Choshi was developed by constructing coastal roads, breakwaters, and wharves. Today, the Choshi Marine Resort, together with a thermal power plant and the busy port, Choshi City is revitalizing. Shore protection measures are being taken. To make the beach more stable, a new breakwater and promenade are under construction."
		},
		{
			"name": "Fukui",
			"country": "Japan",
			"description": "Five wharves handle general cargoes in the Port of Fukui. The North 1 Wharf contains three berths of total length of 555 meters with alongside depth of 10 meters that can accommodate vessels to 15 thousand DWT. North 4 has five berths of total length of 650 meters with alongside depth of 7.5 meters. North 10 has one berth of 130 meters with alongside depth of 7.5 meters. Both North 4 and North 10 can accommodate vessels to five thousand DWT. Another berth on the North Wharf, 180 meters long with alongside depth of 5.5 meters, can accommodate vessels to two thousand DWT. Also accommodating vessels to two thousand meters is an earthquake-proof quay at the North Wharf of 100 meters with alongside depth of 5.5 meters. The public dolphin at the Port of Fukui, handling petrochemical products, is 188 meters long with alongside depth of 7.5 meters, and it can accommodate vessels to two thousand DWT. Four additional berths with total length of 800 meters and alongside depths from three to four meters offer mooring points for vessels from 200 to 300 DWT. The Port of Fukui offers two sheds under Prefectural management for general cargoes. The sheds cover a total area of three thousand square meters. The Port of Fukui Pier warehouse covers 1.3 thousand square meters and supports general cargoes."
		},
		{
			"name": "Hachinohe",
			"country": "Japan",
			"description": "The Hachinohe Port Authority (Japanese) is responsible for managing and operating the Port of Hachinohe. Since 1994, the Port of Hachinohe has included busy domestic and international container services that operate at 48 berths. The container services operate regular routes to Yokohama (domestic), Taiwan, Singapore, Korea, Australia, South America, Europe, Canada, and the United States. The Port of Hachinohe’s Fuel Terminal supplies the local fishing fleet and U.S. military installations in Japan, Korea, and Okinawa. With seven fuel terminals with capacity to store over 11 million barrels, the Hachinohe Fuel Terminal distributed more than 310 million gallons of petroleum products in 1997. The Port of Hachinohe is an active marine product community, having become the biggest coastal industrial city in Northern Tohoku region. In the past decades, new port facilities have been installed, and established facilities have been upgraded. In 1996, the Foreign Access Zone was created."
		},
		{
			"name": "Hakata",
			"country": "Japan",
			"description": "In total, the Port of Hakata has 44 mooring berths with depths over 7.5 meters and 27 mooring berths with depths below 7.5 meters. The Port of Hakata contains 25 transit sheds for general cargo covering almost 65 thousand square meters, two vegetable sheds covering 11.2 thousand square meters, three inspection sheds covering 2.2 thousand square meters, and 30 repair facilities covering 78.4 thousand square meters. The Port of Hakata contains a total of over 25 thousand square meters of freight sorting yards and 968.6 thousand square meters of open sheds. The Hakata Pier handles regular domestic services and municipal ferry services in the Port of Hakata. The Hakata Pier has two berths. Berth 2 is 105 meters long with alongside depth of 5.5 meters, and Berth 3 is 147 meters long with alongside depth of 7.5 meters. Covering almost 5 hectares of reclaimed land, the Hakata Pier handles about 140 thousand tons of cargo per year. Cargoes include beverages, water, mixed lots, animal and plant feed, fertilizers, clothing, shoes, and personal belongings. The berths at the Port of Hakata's 22.3-hectare Kashii Park Port can accommodate 50-ton container ships, and they are equipped with four post-Panamax gantry cranes. The Kashii Park Port handles about 410 thousand TEUs of containerized cargo per year. The Kashii Park facility in the Port of Hakata has storage capacity for 9684 TEUs. It has 2964 dry container slots and 300 reefer points. The terminal building has a floor area of almost five thousand square meters, and the maintenance shop covers 1193 square meters."
		},
		{
			"name": "Hakodate",
			"country": "Japan",
			"description": "The Nishi Pier is the oldest public pier in the port, and its historic buildings give a unique atmosphere to the Port of Hakodate. It contains warehouses, cold stores, and factories. With seven berths and total quay length of 957 meters with alongside depths from 4 to 9 meters, the Nishi Pier serves the government’s official vessels and larger cargo and cruise passenger vessels. The Port of Hakodate’s Toyokawa Pier holds the city’s wholesale fish market. The wharf is 530 meters long with alongside depth of 5 meters, and it is filled with fishing boats from the early morning throughout the day. The wharf contains cold storage warehouses and several fishery facilities. The closest pier to the Hakodate Station, the Wakamatsu Pier is a busy tourist area and morning market. The Port of Hakodate plans to expand the pier and add facilities to educate both residents and tourists about the local marine environment. With a depth from 3.5 to 5 meters, the Kaigan-cho Basin is dedicated to small crafts, including fishing and working boats. The Port of Hakodate’s Chuo Pier contains five berths with a total length of 692 meters with alongside depths from 5 to 9 meters. It is the center for general cargoes and the location of the port government buildings. The Bandai Pier in the Port of Hakodate serves large cargo ships carrying foreign trade cargoes like fish oil, wheat, and timber. It contains five berths of a total 625 meters in length with alongside depths from 5 to 10 meters. The Port of Hakodate’s Kita Pier has four berths with a total length of 599 meters and alongside depths from 5.5 to 7.5 meters. The Kita Pier handles bulk cargoes and passengers. Bulk cargoes include cement, stones, and timber. Ferries use the pier to carry both passengers and cargo. The Minato-cho Pier has the Port of Hakodate deepest waters at 14 meters. Currently being built, the 280-meter pier will include a large service area and accommodate large vessels, including those carrying containerized cargo."
		},
		{
			"name": "Hannan (Kishiwada)",
			"country": "Japan",
			"description": "The Port of Hannan covers about 142 hectares. It contains a 12m quay earthquake-proof with three berths. In addition to the dock facilities, the Port of Hannan contains a regional industrial and manufacturing development. The Port of Hannan intends to expand its facilities to support marine recreation in the area."
		},
		{
			"name": "Hitachinaka",
			"country": "Japan",
			"description": "The new state-of-the-art marine container terminal is making the Port of Hitachinaka an international hub port, linking the Ibaraki, Tochigi, and Gunma Prefectures by the Kita-Kanto Expressway system. The Port of Hitachinaka’s North Wharf Public Container Terminal has a 350-meter long quay with alongside depth of 15 meters that can accommodate vessels to 50 thousand DWT (the same as Tokyo Bay). It includes a fumigation warehouse and maintenance shops. The Port of Hitachinaka’s mooring facilities at the 28-hectare North Wharf Foreign Trade Terminal include three berths of total of 690 meters in length and alongside depths from 10 to 14 meters. The three berths can accommodate vessels to 50 thousand DWT at the 170-meter berth, 30 thousand DWT at the 290-meter berth, and 10 thousand DWT at the 230-meter berth. The 21-hectare North Wharf Domestic Trade Terminal contains eight berths with total length of 890 meters and alongside depths from 5.5 to 7.5 meters. The Port of Hitachinaka’s International Commercial Distribution Center in the Foreign Access Zone covers 12 thousand square meters, and 10 hectares are being developed for open freight yards."
		},
		{
			"name": "Ishinomaki",
			"country": "Japan",
			"description": "In 2005, the Port of Ishinomaki harbor plan included a quay with six new berths with alongside depth of 14 meters and an 87.1 hectare industrial site. The south breakwater was extended to cover 1740 meters with depths from 10 to 14 meters. The Port of Ishinomaki’s public berths contain over 3.1 thousand meters of quays. Fertilizer and steel products are handled at the Siomi (290 meters with 4.5 meters depth) and Major (320 meters with 5.5 meters depth) piers. The Siomi Pier can accommodate vessels to one thousand DWT, and the Major Pier can handle vessels to two thousand DWT."
		},
		{
			"name": "Kawasaki",
			"country": "Japan",
			"description": "The Port of Kawasaki covers over two thousand hectares of land area and almost 3.3 thousand hectares of water surface. The Port of Kawasaki contains 41 public berths with a total length of 6.2 thousand meters and 141 private berths with a total length of 12.6 thousand meters. In 2004, the Port of Kawasaki served 30.6 thousand vessel arrivals and departures, and the port handled 93.6 million tons of cargo. The Kawasaki Container Terminal can serve two vessels at the same time at its KC-1 berth. The berth is 431 meters long with alongside depth of 14 meters, and it can accommodate vessels up to 50 thousand DWT. The Higashi-Ohgishima Wharf in the Port of Kawasaki handles general cargo and contains nine berths with a total length of 2050 meters and alongside depths of 10 and 12 meters. Berths 1 and 2 are each 185 meters long with alongside depth of 10 meters and can accommodate vessels of up to 15 thousand DWT. Berths 3-9 are each 240 meters long with alongside depth of 12 meters and can accommodate vessels to 30 thousand DWT. The Port of Kawasaki's container warehouses in Higashi-Ohgishima are run by about 70 private businesses. The total capacity of all warehouses is about one million tons, including 600 thousand tons of refrigerated cargo. About half of Kanagawa Prefecture's capacity for refrigerated storage is concentrated in this complex. Handling general cargo, the Port of Kawasaki's Chidori-cho Pier contains seven berths that total 1301 meters in length and have alongside depths from 7.3 to 10 meters. Berth 1 is 120 meters long alongside depth of 7.3 meters, and it can accommodate vessels to three thousand DWT. Berth 2 is 171 meters long alongside depth of 9 meters, and it can accommodate ships to 10 thousand DWT. The remaining five berths range in length from 171 to 220 meters, but all have alongside depth of 10 meters and can accommodate vessels of up to 15 thousand DWT. The Port of Kawasaki's Terminal 1 contains two 40.6 ton capacity super gantry cranes that serve Panamax ships and eight 40.6-ton capacity transfer cranes. Terminal 1 has 312 reefer points, and the Port of Kawasaki plans to increase these to 546. The terminal can serve two vessels at the same time. Terminal 2 covers a total area of 245 thousand square meters and has a container storage yard with capacity for 8.7 thousand TEUs. The 431 meter long berth has alongside depth of 14 meters and an apron that is 30.5 meters wide. The terminal can accommodate container vessels of up to 50 thousand DWT. The terminal includes a maintenance shop of 910 square meters, a container terminal system with capacity for 1865 TEUs, and temporary storage space for up to 144 TEUs of dangerous cargo."
		},
		{
			"name": "Kinuura",
			"country": "Japan",
			"description": "The Port of Kinuura public wharves contain 56 berths totaling 5600 meters in length with alongside depths from 8 to 24 meters. In the Yutaka Take, the main quay has three berths of 180 meters with alongside depth of 9 meters that can accommodate vessels of up to 700 DWT."
		},
		{
			"name": "Kisarazu",
			"country": "Japan",
			"description": "The Port of Kisarazu's public wharves are located in the inner harbor, the Kisarazu South district, and the Futtsu district. The inner harbor contains a 788 meter long lighter's wharf with alongside depth of 3 meters. The Kisarazu South facilities are used primarily for shipping locally-produced sand. Kisarazu South has five piers wharves with 11 berths. The lighter's wharf is 721 meters long with alongside depth of 4 meters. The Port of Kisarazu's South district also contains a 288 meter wharf with four berths with alongside depth of 4.5 meters. Its 360-meter wharf also has four berths, but it has alongside depth of 5.5 meters. The 280-meter wharf has two berths and alongside depth of 7.5 meters, and the 240-meter wharf has one berth with alongside depth of 12 meters. The Port of Kisarazu's Futtsu district contains two public wharves with six berths. Containing four berths, one wharf is 360 meters long with alongside depth of 7.5 meters. The other wharf is 260 meters long with alongside depth of 7.5 meters, and one of its two berths is earthquake resistant. The Futtsu district in the Port of Kisarazu is steadily growing as a development base for the region."
		},
		{
			"name": "Kitakyushu",
			"country": "Japan",
			"description": "The Port of Kitakyushu's Kokura container terminal covers 70 thousand square meters. Also under public management, it has 440 meters of quay and can handle 3366 TEUs of containerized cargo. The Port of Kitakyushu's Kokura International Distribution Center provides multi-storage, disposal, and distribution of goods. Opening in 2005, the Port of Kitakyushu's Hibiki Container Terminal is the only terminal on the Japan Sea with a deep-water pier that can accommodate post-Panamax vessels. The terminal covers some 39 hectares, and it offers two piers, each with two berths. One pier is 700 meters long with alongside depth of 15 meters, and the other pier is 340 meters long with alongside depth of 10 meters. The Hibiki Container Terminal in the Port of Kitakyushu has capacity to store over 22.4 TEUs, and it offers 324 reefer points for refrigerated containers. Furthermore, the area along the Hibiki Container Terminal is being developed as an industrial park."
		},
		{
			"name": "Kobe",
			"country": "Japan",
			"description": "There are six container terminals at the Port of Kobe's Port Island. Except for Berth PC18, all berths have berthing distance of 350 meters (1148 feet) with alongside depth of 15 meters (49.2 feet). Berth PC13 is leased by American President Lines Ltd. and The Sumitomo Warehouse Company Limited, and the 12.9 hectare terminal is operated by The Sumitomo Warehouse Company. The 12.3-hectare terminal at the Port of Kobe's Berth PC14 is leased by Mitsui O.S.K. Lines Limited and operated by Shosen Koun Company Limited (Japanese). The Port of Kobe's 12.9-hectare terminal at Berth PC15 is leased by Mitsui O.S.K. Lines, The Sumitomo Warehouse Company, Sankyu Inc., and Nickel & Lyons Limited (Japanese) and operated by Shosen Koun Company Limited (Japanese), The Sumitomo Warehouse Company, Sankyu Inc., and Nickel & Lyons. Mitsui-Soko Company Limited both leases and operates the 12.9-hectare terminal at Berth PC 16 and the 12.3-hectare terminal at Berth PC17 on the Port of Kobe's Port Island. The Port of Kobe's terminal at Berth PC18 is a high-standard container terminal with quays that can support 5500-TEU-class vessels with drafts to 15 meters (49.2 feet). Kamigumi Company Limited both leases and operates the 16.3-hectare terminal. Berth PC has berthing distance of 400 meters (1312 feet) with alongside depth of 16 meters (52.5 feet) on one side and berthing distance of 350 meters (1148 feet) with alongside depth of 15 meters (49.2 feet) on the other side. Rokko Island in the Port of Kobe has three container terminals with a total area of 61.3 hectares. The Port of Kobe 12.3-hectare container terminal at Rokko Island Berth RC2 is leased and operated by Mitsui-Soko Company Limited. RC2 has berthing distance of 350 meters (1148.3 feet) with alongside depth of 13 meters (42.7 feet). The 24.5-hectare container terminal at the Port of Kobe's RC4 on Rokko Island is leased by Kawasaki Kisen Kaisha Limited and operated by Nitto Total Logistics Limited (Japanese). RC4 has berthing distance of 530 meters (1739 feet) with alongside depth of 14 meters (45.9 feet). The 12.3-hectare container terminal at Rokko Island's Berth RC5 in the Port of Kobe is leased by Maersk K.K. and operated by the Mitsubishi Logistics Corporation. RC5 has berthing distance of 350 meters (1148 feet) with alongside depth of 14 meters (45.9 feet). Nippon Yusen Kaisha Limited leases the container terminals at the Port of Kobe's RC6 and RC7 berths. Mitsubishi Logistics Corporation operates the Port of Kobe 12.3-hectare container terminal at the Rokko Island Berth RC6 which has berthing distance of 350 meters with alongside depth of 14 meters. UNI-X Corporation and Nippon Container Terminal Company Limited operate the 12.3-hectare container terminal at Berth RC7 which has berthing distance of 350 meters with alongside depth of 14 meters."
		},
		{
			"name": "Kochi",
			"country": "Japan",
			"description": "The Port of Kochi contains two areas: Urado Wan and an area of open ocean known as the new port. Some local industries own and operate private berths to support their plants related to cement, minerals, shipbuilding, timber, and distribution of petroleum. The Urado Wan area covers 150 hectares of land and 800 hectares of water surface. In the Port of Kochi's Urado Wan area, more than seven thousand meters of berth boat berths are available with alongside depth of 7.5 meters. There are open storage areas of 28.1 thousand square meters and warehouses of over nine thousand square meters in the Urado Wan area. The new port area in the Port of Kochi contains two 240 meter long berths, one with alongside depth of 8 meters and the other with alongside depth of 12 meters. The new port's container yard covers more than 55.5 thousand square meters and contains 60 reefer power points and two disinfection units. Next to the public area, a semi-public Kochi Trade Service Company Limited operates general warehouses that include general warehouses of almost four thousand square meters, almost five thousand square meters of refrigerated warehouse, and over 2.9 thousand square meters of transit sheds."
		},
		{
			"name": "Kushiro",
			"country": "Japan",
			"description": "With vessel times increasing, the Port of Kushiro has implemented facility improvements that were completed in 2008. Included in these improvements were deeper quay walls and new wharves with capacity for 50 thousand DWT vessels."
		},
		{
			"name": "Maizuru",
			"country": "Japan",
			"description": "The Port of Maizuru has five public wharves of a total 2410 meters for large vessels. No. 2 Wharf contains four berths with of total 645 meters in length with alongside depths from 7.5 to 10 meters. Wharf No. 3 has two berths and is 370 meters long with alongside depth of 10 meters. No. 4 Wharf has four berths with a total length of 485 meters with alongside depth of 10 meters. The Kita Wharf has two berths totaling 370 meters long with alongside depths from 7.5 to 12 meters. Finally, the Maejima Wharf has four berths with total length of 540 meters and alongside depths from 5.5 to 8 meters. Two dolphins offer alongside depth of 10 meters. Transit sheds at the No. 2, No. 4, and Maejima Wharves cover an area of 11.5 thousand square meters. Warehouses at No. 2, No. 3, and No. 4 Wharves cover 26.8 thousand square meters. The Okimi District contains cement silos with capacity for 26.9 thousand cubic meters. The timber ponds in the Okimi, Kita, Katsura, and Taira Districts cover 518.1 thousand square meters, and the timber yards at Okimi and Kita Districts and the No. 4 and Maejima Wharves cover 272.2 thousand square meters."
		},
		{
			"name": "Mizushima",
			"country": "Japan",
			"description": "The Port of Mizushima’s Container Terminal covers about 33 hectares and includes two quays. One quay can accommodate container ships to 30 thousand DWT with alongside depth of 12 meters, and the other serves container ships to 10 thousand DWT with alongside depth of 10 meters. The harbor plan will bring all depths to 12 meters. The unit load terminal within the Container Terminal covers a pier site of 16 hectares and includes four berths with alongside depth of 7.5 meters that can accommodate freighters to five thousand DWT."
		},
		{
			"name": "Nagasaki",
			"country": "Japan",
			"description": "The passenger terminal covers a total area of 550 square meters. The passenger terminal in the Port of Nagasaki wharf is 360 meters long with alongside depth of 12 meters, and it has a 20-meter wide apron. The facility includes a 230 square meter lobby, a customs area of 170 square meters, an immigration area of 70 square meters, and a quarantine area of 30 square meters."
		},
		{
			"name": "Nagoya",
			"country": "Japan",
			"description": "The Port of Nagoya is approached through three major channels. The East Channel is 10 kilometers (6.2 miles) long, from 500 to 610 meters (1640 to 2001 feet) wide, and 15 meters (49.2) deep. The West Channel is 8.4 kilometers (5.2 miles) long, from 350 to 400 meters (1148 to 1312 feet) wide, and from 12-15 meters (39.4 to 49.2 feet) deep. The Port of Nagoya's North Channel is five kilometers (3.1 miles) long, 200-400 meters (656 to 1312 feet) wide, and from 10-12 meters (32.8 to 39.4 feet) deep."
		},
		{
			"name": "Naha",
			"country": "Japan",
			"description": "The Port of Naha’s International Container Terminal is operated by stevedoring companies on a short-term lease. The terminal includes three berths of a total length of 950 meters. The oldest berth (1997) is 300 meters long with alongside depth of 14 meters. Berth No. 10 was completed in 2005, and it is 300 meters long with alongside depth of 15 meters. The newest berth, No. 11, will be 350 meters long with alongside depth of 15 meters. The container terminal at the Port of Naha covers 385 thousand square meters and can handle up to 800 thousand TEUs of cargo per year."
		},
		{
			"name": "Nanao",
			"country": "Japan",
			"description": "The Port of Nanao is an open port with a channel draft limitation of 9.8 meters. The berth at the Port of Nanao, the Ohta Bussan Futo, is 179.5 meters long with alongside depth of 9.7 meters, and it can accommodate vessels to 30 thousand metric tons. Permanent fishing nets make anchoring at outport very difficult. Large vessels should drift a minimum of 16 kilometers offshore and wait for a pilot to bring them to port. Port of Nanao services include hold cleaning and cargo fumigation. Three log gangs are available, and cargo is handled at the Port of Nanao by ship’s crane and shore grabs."
		},
		{
			"name": "Naoetsu",
			"country": "Japan",
			"description": "The West Wharf at the Port of Naoetsu contains two berths for unloading cargo. The berths are a total of 359 meters long with alongside depth of 10 meters, and they can accommodate vessels to 15 thousand DWT. The Port of Naoetsu’s South Pier, which is devoted to passengers, is 170 meters long with alongside depth of 7.5 meters, accommodating vessels to 6 thousand DWT. The Center Wharf at the Port of Naoetsu has two berths of a total 315 meters. Accommodating vessels to 5 thousand DWT, Berth 1 is 130 meters long with alongside depth of 7.5 meters. Berth 2 is 185 meters long with alongside depth of 10 meters, and it can accommodate vessels to 15 thousand DWT. The Port of Naoetsu’s East Wharf contains five berths of a total 815 meters long. Berths 1, 4, and 5 are 130 meters long each with alongside depth of 7.5 meters, and each of them can accommodate vessels to five thousand DWT. Berth 4 specializes in handling containers. The East Wharf’s Berth 2 at the Port of Naoetsu is 240 meters long with alongside depth of 8 meters, and it can accommodate vessels to 15 thousand DWT. Berth 3 is 185 meters long with alongside depth of 10 meters, and it also accommodates vessels to 15 thousand DWT. Serving vessels up to 15 thousand DWT, the Port of Naoetsu’s Lumber Pier is 185 meters long with alongside depth of 10 meters. The Kosanhin Pier is 270 meters long with alongside depth of 13 meters, and it can accommodate vessels to 50 thousand DWT. The Kikenbutsu Wharf at the Port of Naoetsu has three berths with total length of 390 meters with alongside depth of 7.5 meters, and each of them can serve vessels to five thousand DWT."
		},
		{
			"name": "Niigata",
			"country": "Japan",
			"description": "Many companies use the Port of Niigata’s East Port District as a base for international distribution, energy, and foreign trade. The East Port District contains 17 wharves with 31 berths and a total length of 4.5 thousand meters. Three dolphin berths offer alongside depths of 13 and 14 meters. The West Wharf at the Port of Niigata’s East Port District has six berths of a total 776 meters length and a depth of 7.5 meters. At 232 meters long, the Central Wharf has four berths, two with alongside depth of 13 meters and two with alongside depth of 7 meters. The two Shin-Nittetsu Berths are 250 meters long with alongside depth of 7.5 meters. The East Port District in the Port of Niigata presently has three container berths at the West Wharf: one of 185 meters with alongside depth of 10 meters, another at 130 meters with alongside depth of 7.5 meters, and the third at 350 meters with alongside depths from 12 to 14 meters. Two more container berths are planned at the West Wharf that will be 500 meters long with alongside depth of 12 meters. The Port of Niigata’s South Wharf in the East Port District contains two lumber berths of 370 meters with alongside depth of 10 meters, and another is planned that will be 240 meters long with alongside depth 12 meters. The Zen-no Silo Berth is 100 meters long with alongside depth of 6 meters. The West Port District’s East Wharf has two berths and plans to add two more. Existing berths are 280 meters long with alongside depths to 14 meters. The planned berths will be 240 and 170 meters long with alongside depth of 10 meters. The Port of Niigata’s Nisseki A Berth is 150 meters long with alongside depth of 6 meters. Finally, the Central Wharf East has two berths of 520 meters with alongside depth 13 meters. The West Port District in the Port of Niigata is the cargo-handling and passenger ferry area. It is home to the 2003 international convention complex Toki Messe. The current Bandaijima Redevelopment Project aims to transform the Port of Niigata’s West Port District into a modern international relations center. It has nine wharves with a total length of 4.9 thousand meters with 32 berths and alongside depths from 7.5 to 11 meters. The Port of Niigata’s Rinko Harbor is a private wharf with eight berths of 1,657 meters and alongside depths from 8 to 11 meters. In the West Port District of the Port of Niigata, the two Yamanoshita Wharf North Berths are 330 meters long with alongside depth of 9 meters, and the two Yamanoshita Wharf South Berths are 260 meters long with alongside depth of 7.5 meters. The three North Wharf berths are 427 meters long with alongside depths from 7.5 to 9.5 meters. Two East Wharf berths total 231 meters at a depth of 7.5 meters. The Port of Niigata’s Central Wharf at the West Port District contains five berths. The two North Berths are 294 meters long with alongside depth 9.5 meters. The End Berth is 137 meters long with alongside depth 7.5 meters. The two South Berths are 307 meters long with alongside depth of 7.5 meters. The two berths at the South Wharf are 288 meters log with alongside depth of 7.5 meters. The Bandaijima Wharf has eight berths with a total length of 1003 meters and alongside depths from 5.5 to 7.5 meters."
		},
		{
			"name": "Niihama",
			"country": "Japan",
			"description": "The Port of Niihama consists of two quarters: Niihama Quarter and Takihama Quarter. The Takihama Quarter is the site for the terminal for ferries to Kobe and Osaka. The Niihama Quarter is the cargo-handling area. Pilotage is not required for entry to and exit from the Port of Niihama, although harbor ports are available at the quarantine anchorage. Pilots are generally not available from sunset to sunrise. Anchorage for vessels carrying dangerous goods in the Port of Niihama must be assigned by the Captain of the Port."
		},
		{
			"name": "Oita",
			"country": "Japan",
			"description": "The 25-hectare Ozai Container Terminal at the Port of Oita has capacity to store over 4.7 thousand TEUs of containerized cargo. The terminal has two berths of 280 meters with alongside depth of 14 meters and one 170-meter long berth with alongside depth of 10 meters. The terminal operates 24 hours a day, 365 days a year. With 56 reefer plugs, it offers large-scale cold storage for frozen and chilled cargo in a warehouse at the container yard operated by OITAC. The warehouse covers 7.3 thousand square meters in a two-story building that includes cargo-handling, storage, distribution, and processing facilities."
		},
		{
			"name": "Onahama",
			"country": "Japan",
			"description": "The Port of Onahama is strengthening its container-handling capacity to become an even more important distribution port for cargoes throughout northern Japan. At the same time, the Port of Onahama has re-developed Piers 1 and 2 as a tourist center and marine science museum while it is making improvements to the port’s original facilities. Piers 1 and 2, together with the Iwaki tourist and seafood products center, the marine science pavilion, and the green zone Aquamarine Park, the re-developed port attracts about 2.5 million tourists a year to the Port of Onahama. The Port of Onahama’s Foreign Trade Container Terminal covers 23.8 thousand square meters. It contains the 180-meter-long Ohtsurugi Pier 1 berth with alongside depth of 10 meters. The terminal can store 546 TEUs of containerized cargo, and it has an additional 20 reefer sockets for cooling containers."
		},
		{
			"name": "Osaka",
			"country": "Japan",
			"description": "In the Port of Osaka's Nanko District (Sakishima), containerized cargoes are handled at six public berths and five exclusive container berths. For the most part, these Port of Osaka berths serve international container vessels traveling to/from Southeast Asia, China, and Australia. They are also the container distribution base for the Port of Osaka. The Nanko International Container Center and the Osaka Port Integrated Cargo Center work together to support shippers and ensure the efficient operations of the Port of Osaka distribution center. The Nanko International Container Center covers a total area of 7.4 hectares and includes 3.9 hectares of transit shed and a five hectares of marshaling yard. Covering 8.5 hectares in two buildings, the Osaka Port Integrated Cargo Distribution Center is a state-of-the-art facility with capacity to respond quickly to changes in materials, cargo volumes, and distribution routes."
		},
		{
			"name": "Sakaide Ko",
			"country": "Japan",
			"description": "The Sakaide Port Administration is the port authority governing the Port of Sakaide. The port is located near the Inland Sea’s main shipping route, and many large vessels enter the coastal industrial zone. The Port of Sakaide is divided into two sections. The Cosmo Oil Company’s No. 1 berth is located less than a mile west of Sei Sima. Pilotage is only compulsory in the Bannosu area for vessels of more than ten thousand gross tons. Vessels over 25 thousand gross tons carrying liquefied petroleum gas may not enter the port at night, as pilots are generally not available from sunset to sunrise. The Port of Sakaide offers tugboats and launches to support vessels using the port."
		},
		{
			"name": "Sasebo",
			"country": "Japan",
			"description": "The Port of Sasebo (Japanese) is Sasebo City’s most outstanding feature. From its opening in 1889 until World War II, it was a major trade port for Western Japan with a flourishing shipbuilding industry. The Sasebo Port Terminal covers about five thousand square meters. With the arrival of the Americans in the late 1940s and early 1950s, it became known as the “Naval Base City.” The influence of the US citizens who lived there can be seen everywhere in the Port of Sasebo. The Port of Sasebo has an active fishery. The fishing fleet stays near the coast where it finds abundant fish, and many oyster and pearl farms are located on the Port of Sasebo’s Kujuku Island. Oysters from the Port of Sasebo are prized all over Japan."
		},
		{
			"name": "Sendai",
			"country": "Japan",
			"description": "The Container Terminal facilities cover 201.5 thousand square meters. The quay contains two berths. One is 270 meters long with alongside depth of 12 meters, and the other is 330 meters long with alongside depth of 14 meters. The terminal has capacity for 2.2 thousand dry container TEUs and 60 reefer containers, while it has 75 electrical reefer outlets. The terminal is equipped with a fumigating house, a 1.5 thousand square meter container freight station, a maintenance shop, and a 23.6 thousand square meters chassis space. Cargo operators at the Port of Sendai’s Container Terminal are Shiogama-ko Unso and Snirku Unyu. Gates are closed Sundays and holidays."
		},
		{
			"name": "Shimuza",
			"country": "Japan",
			"description": "Since container services began at the Port of Shimizu in 1970, the port has focused on developing container cargo activities in the Hamamatsu area. A container terminal was built at the Okitsu Wharf, followed by a new container terminal at the Sodeshi Wharf. The Shin-Okitsu International Container Terminal began operating in 2002, and the Port of Shimizu continues to upgrade the container yard. With a berth of 350 meters and a depth of 15 meters, the Shin-Okitsu container terminal can accommodate the latest and largest container vessels, and it has capacity to handle eight thousand TEU vessels."
		},
		{
			"name": "Shimonoseki",
			"country": "Japan",
			"description": "The Port of Shimonoseki’s Main Port area includes the No. 1 Wharf with mooring capacity for seven vessels at five berths with a total length of 956 meters and alongside depths from 4.5 to 13 meters. With depth of 4.5 meters, Berth No. 8 (210 meters) can accommodate two vessels to 500 DWT, and Berth No. 11 (120 meters) can accommodate two vessels to 700 DWT. With alongside depth of 9 meters, Berths 12 and 13 (330 meters) can accommodate two vessels to 10 thousand DWT. Berth 10 is 296 meters long with alongside depth of 13 meters and can accommodate vessels to 20 thousand DWT. The No. 2 Wharf in the Port of Shimonoseki’s Main Port area contains three berths with total length of 542 meters and alongside depths of 9 and 10 meters. Berth No. 15, at 150 meters long with alongside depth of 9 meters, can accommodate vessels to 10 thousand DWT, and Berths 16 and 17 (at 392 meters with alongside depth of 10 meters) can accommodate vessels to 15 thousand DWT. This wharf serves cargoes of marine products and aluminum carried by Chinese and Korean vessels, and it has 36-ton refrigerator and freezer warehouses. The Hosoe Wharf can moor six vessels. Berths 20, 21, and 22 (at 213 meters long with alongside depth of 5.5 meters) can accommodate vessels to two thousand DWT. Berths 18 and 19 are 260 meters long with alongside depth 7.5 meters and can accommodate vessels to 5 thousand DWT. The Hosoe Wharf main berth is 370 meters long with alongside depth of 10 meters, and it can accommodate two vessels to 15 thousand DWT. The Hosoe Wharf is the major ferry wharf for the Port of Shimonoseki. It also receives imported cargoes for delivery inland by truck and rail. The Hosoe Wharf has customs and quarantine services, fumigation facilities, food inspection service."
		},
		{
			"name": "Suzaki",
			"country": "Japan",
			"description": "The Kochi Port Authority is responsible for managing and operating the Port of Susaki, which has an anchorage area of 16 hectares. The harbor has a draft limitation of 8.4 meters, but pilotage is not required. The Port of Susaki has three tugs available. The Port of Susaki offers hold cleaning facilities and cargo fumigation services. A maximum of three log gangs are available, and discharge of cargo is by ship’s crane and shore grabs. The 15-thousand-ton wharf at the Port of Susaki offers 8.3 meters draft (8.8 at high tide) and can accommodate vessels to 185 meters long up to 32 thousand DWT."
		},
		{
			"name": "Tokyo",
			"country": "Japan",
			"description": "The Port of Tokyo's Oi Container Terminal is one of Japan's most modern facilities, and it is central to the international distribution of goods. The Oi Container Terminal in the Port of Tokyo covers a total 945.7 thousand square meters (almost 234 acres). It contains seven berths with a total length of 2,354 meters (7.7 thousand feet) with alongside depth of 15 meters (49.2 feet). The Oi Container Terminal can accommodate vessels to 50 thousand DWT. Equipped with 20 cranes, the Port of Tokyo's Oi Container Terminal can handle over 57.6 thousand TEUs of containerized cargo, and it has 2,578 reefer slots. Forty companies operate ultra-modern distribution facilities at the Oi Container Terminal in the Port of Tokyo with 33 hectares of warehouse space. The Aomi Container Terminal in the Port of Tokyo has five berths with a total length of 1,570 meters (over 5.1 thousand feet). Two of these berths have alongside depth of 13 meters (42.7 feet) and can accommodate vessels to 35 thousand DWT. The remaining three berths in the Port of Tokyo's Aomi Container Terminal have alongside depth of 15 meters (49.2 feet) and can accommodate vessels to 50 thousand DWT. The Aomi Container Terminal has space for 24,883 TEUs of containerized cargo, including 1,335 reefer slots. The Port of Tokyo's Shinagawa Container Terminal is a public terminal managed by the Tokyo Metropolitan Government. Opened in 1967, it is the oldest container terminal in Japan. Today, it serves container routes to China, Korea, Southeast Asia, and coastal routes. The Shinagawa Container Terminal in the Port of Tokyo covers a total of 96.7 thousand square meters (23.9 acres). The Port of Tokyo's Shinagawa Container Terminal serves both foreign and domestic trade. It has three berths devoted to foreign trade containers totaling 190 meters (623 feet) with alongside depths of 10 meters (32.8 feet). It is equipped with four container cranes and has space for 5,598 TEUs of containerized cargo including 272 reefer slots. The Wakasu Terminal handles domestic container cargo in the Port of Tokyo. The berth dedicated to this cargo is 190 meters long (623 feet) with alongside depth of 11 meters (36.1 feet), and it can accommodate vessels to 15 thousand DWT."
		},
		{
			"name": "Tomakomai",
			"country": "Japan",
			"description": "The one-mile entrance channel to the Port of Tomakomai harbor is protected by breakwaters leading to the harbor basin. The channel is maintained at a depth of 14 meters, and the port can be entered both night and day. The Port of Tomakomai offers 10 tugs from 380 to 4000 horsepower. The Eastern District of the Port of Tomakomai has a buoyed, lighted channel that is dredged to 17.5 meters decreasing to 16 meters at and in the turning basin to a dolphin berth on the north side of the breakwater. The berth is designed to handle tankers to 130 thousand DWT with a draft of 14.5 meters. The berth is surrounded by a submersible oil boom. Both the Central North berth and the East Harumi Pier are 240 meters long with alongside depth of 10.8 meters and can accommodate vessels to 30 thousand DWT. The Port of Tomakomai has a maximum of three log gangs available as well as cargo-fumigation services. Discharge of cargo is by ship’s gear and shore grabs."
		},
		{
			"name": "Toyohashi",
			"country": "Japan",
			"description": "The Jinno District is the Port of Toyohashi’s main wharf. It includes the East Zone of 96 hectares and the West Zone of 120 hectares. The district includes five public quays ranging from a quay with alongside depth of 4.5 meters for domestic trade to a quay with alongside depth of 12 meters for foreign trade. The Jinno District’s quays are a total of 3.5 thousand meters long and can accommodate vessels to 30 thousand DWT. The Port of Toyohashi’s East Zone public quay offers huge stack yards and many warehouses and sheds to support a variety of cargoes, including motor vehicle imports and exports. The East Zone is popular for its green park. The West Zone at the Port of Toyohashi includes a public quay and an industrial complex. Construction is underway for port facilities in this zone, including creating larger quays for foreign trade. The Toyohashi Container Terminal that started operations at Jinno No. 7 Quay in 1998. The port hopes to attract more industry and foreign companies through implementation of its reclamation plan. The Port of Toyohashi’s Funato District handles domestic cargoes at 21 berths with alongside depths from 4 to 5.5 meters. The 4.5-meter berths are earthquake-proof, and green areas are being created at the waterline."
		},
		{
			"name": "Wakkanai",
			"country": "Japan",
			"description": "The Wakkanai Base Company (WABCO) is the port authority responsible for managing and operating the Port of Wakkanai. The Port of Wakkanai is an international trading port visited by about four thousand vessels and 70 thousand foreigners each year. The marine products industry is the base of the port’s economy. The Port of Wakkanai also operates busy ferry services to Rebun and Rishiri (which are national parks) as well as an international ferry service to Sakhalin Island, Russia. The Port of Wakkanai has a unique dome-shaped breakwater that recalls a Greek temple. The 427-meter-long half-arch breakwater hides an inside walkway."
		},
		{
			"name": "Yawata",
			"country": "Japan",
			"description": " Port of Yawata is the industrial heart of the Port of Kitakyushu, a major port on Kyushu, Japan’s third largest island. The Port of Yawata was incorporated into the city of Kitakyushu in 1963. The Port of Yawata specializes in iron and steel, heavy chemicals, cement, and glass. Now a ward of the city of Kitakyushu and managed by the Kitakyushu Seaport and Airport Bureau, the Port of Yawata contains Space World amusement park and the Kawachi Reservoir, which was the largest dam in Asia when it was built in the 1920s. The Port of Yawata also has a hot spring facility (onsen) that includes both indoor and outdoor bathing facilities. The Port of Yawata is located near many coal mines. With coke plants and steel mills (including a Nippon Steel Corporation plant) in the Port of Yawata make much of Japan’s steel. The plants were targets of the first United States air raid on Japan in 1944."
		},
		{
			"name": "Yokkaichi",
			"country": "Japan",
			"description": "The Port of Yokkaichi’s 800-meter-long No. 1 Pier contains four berths that can accommodate six vessels at a time with alongside depths ranging from three to nine meters. Two berths can support vessels to 10 thousand DWT, one berth accommodates vessels to 8 thousand DWT, and the smaller berth with alongside depth of 3 meters can accommodate vessels to 300 DWT. The No. 1 Pier has six public sheds offering a total of 10.4 thousand square meters of storage area. The main cargoes handled at No. 1 Pier supports cargoes of chemicals and synthetic resins. The No. 2 Pier at the Port of Yokkaichi is a total 930 meters long with alongside depths ranging from 5 to 10 meters. The three largest of six berths can accommodate vessels to 15 thousand DWT. The Port of Yokkaichi’s No. 2 Pier also has public sheds offering 20.7 thousand square meters of storage and a public sorting area of almost 8 thousand square meters. The No. 2 Pier also offers 2.8 thousand square meters of car storage and grain silos with total capacity for storing almost 59 thousand tons of grain. The major cargoes handled at the No. 2 Pier are grains. At a total 799 meters long, the Port of Yokkaichi’s No. 3 Pier has five berths with depths ranging from 7.5 to 12 meters. The largest berth, 245 meters long with alongside depth 12 meters, can accommodate vessels to 30 thousand DWT. Two berths, each 220 meters long with alongside depth of 10 meters, can accommodate vessels to 15 thousand DWT. The smallest berth (114 meters long with alongside depth of 7.5 meters) accommodates vessels to 5 thousand DWT. Equipped with a pneumatic unloader, the No. 3 Pier contains three public sheds of a total 12.4 thousand square meters and five public sorting areas of 28.2 thousand square meters. The primary cargoes handled at No. 3 Pier are grains, minerals, and ores arriving on ocean-going vessels. The No. 4 Pier at the Port of Yokkaichi is a coal berth of 125 meters with alongside depth of 7.5 meters, accommodating vessels to 5 thousand DWT. The Port of Yokkaichi’s Kasumigaura Area covers about 3.8 million square meters, and the South Pier covers about 1.3 million square meters. The South Pier, with a total length of 2800 meters and alongside depths ranging from 4.5 to 14 meters, has mooring capacity for 25 vessels ranging from 700 to 60 thousand DWT. One berth (at 14  meters depth) can support vessels to 60 thousand DWT, two berths (at 12 meters depth) can accommodate vessels to 40 thousand DWT, and one berth (12 meters) serves vessels to 30 thousand DWT. Two berths at 4.5 meters depth can accommodate 11 vessels to 700 DWT. One berth (depth of 7.5 meters) handles vessels to 5 thousand DWT, and one berth (depth of 5.5 meters) can accommodate seven vessels to 2 thousand DWT. Wharf No. 25 at the Port of Yokkaichi’s South Pier is 240 meters long with alongside depth of 12 meters and mooring capacity of 40 thousand DWT. It contains two public sorting areas covering 55.4 thousand square meters. The Port of Yokkaichi’s South Area Wharf No. 22 is 280 meters long with alongside depth of 14 meters and mooring capacity for vessels to 60 thousand DWT. Wharf No. 22 contains a public sorting area of 12.2 thousand square meters. It also has coal string capacity for one million tons in 151.8 thousand square meters. The Wharf has capacity to handle three million tons of coal per year."
		},
		{
			"name": "Yokosuka",
			"country": "Japan",
			"description": "The Port of Yokosuka harbor area covers over 5.5 thousand hectares and contains 100 berths at depths of more than 4.5 meters. In 2004, over 28 thousand ships visited the port carrying more almost 17 million tons of cargo, including 2.1 million tons of foreign cargo and 14.8 million tons of domestic goods. This included about 8.8 million tons of exports and 8.1 million tons of imports. The Port of Yokosuka contains five major freight areas: Pursuit beach (with an anchoring area of 229 thousand square meters), Nagaura (395.9 thousand square meters), Newport (593.7 thousand square meters), Heisel (95.6 thousand square meters), and Hisashi village beach (1.1 million square meters). An additional 6.1 million square meter quarantine berth lies outside the main port area. Of the total 9.1 million square meters of anchoring area, 7.2 million square meters (over 78%) is at depths of 9 meters and above, 730.7 thousand square meters (8%) is at depths from 7.5 to 9 meters, and the remaining 1.2 million square meters (14%) is at depths from 4.5 to 7.5 meters."
		},
		{
			"name": "Banjarmasin",
			"country": "Indonesia",
			"description": "The Port of Banjarmasin (Indonesian) manages three terminals: Martapura Baru, Trisakti, and Basirih. The port is constructing a new terminal to accommodate increased traffic in containerized cargo (200 thousand TEUs in 2005). The Port of Banjarmasin’s Trisakti terminal handles containers, coal, and passengers. The oldest terminal, Martapura Baru, has been closed, and its cargo traffic has been moved to Basirih. The Port of Banjarmasin is Kalimantan’s most important river port, and it is the gateway to Central and South Kalimantan. The Trisakti terminal is the trade center for the basin, and it handles exports that include diamonds, gold, rubber, timber, coal, and pepper. The Port of Banjarmasin is also supported by the region’s industries, coal mining and timber processing."
		},
		{
			"name": "Banten",
			"country": "Indonesia",
			"description": "Facilities at the Port of Banten include a 200-meter quay with alongside depth of 15 meters and 3.5 hectares of container yards. The facilities have capacity to handle one million tons of bulk cargo and 200 thousand TEUs of containerized cargo."
		},
		{
			"name": "Belawan",
			"country": "Indonesia",
			"description": "Facilities at the Port of Belawan include four major wharves: Belawan Lama (688.7 meters long), Ujung Baru (1555.8 meters long), the ferry wharf (115.0 meters long), the Citra wharf (635.0 meters long), and the IKD wharf (150.0 meters long). Belawan Lama at the Port of Belawan contains storage and handling facilities of 5.0 thousand square meters of covered space and 11.5 thousand square meters of open yards. Ujung Baru contains 38.5 thousand square meters of covered space and 19.2 thousand square meters of open yards, and Ujung Baru Lini II also has 1.5 thousand square meters of covered space. The Citra wharf contains 16.8 thousand square meters of covered space and 25.2 thousand square meters of open yards. The IKD wharf has 9.4 thousand square meters of open yard. CFS 3 offers 7.0 thousand square meters of covered space. Gudang Terbuk offers 1.9 thousand square meters of covered space, and CY has 64.9 thousand square meters of open yards. The Port of Belawan’s Ferry Terminal at Luar Negeri, for outgoing traffic, covers 539 square meters and has capacity for 720 people on one trip. The Dalam Negeri for incoming traffic covers 2.3 thousand square meters and has capacity for 2.2 thousand people."
		},
		{
			"name": "Cirebon, Java",
			"country": "Indonesia",
			"description": "The Port of Cirebon occupies 25 hectares for port operations and 26 hectares for warehousing and storage. The port contains five cargo-handling berths with alongside depth of to 7 meters. The Muarajati I berth is 275 meters long with alongside depth of 7 meters. The Muarajati II berth is 248 meters long with alongside depth of 5.5 meters. The Muarajati III berth is 80 meters long with alongside depth of 7 meters. The Linggarjati I berth is 131 meters long with alongside depth of 4.5 meters, and the Samadikun berth is 67 meters long with alongside depth of 3.5 meters. The Port of Cirebon also contains 12 smaller berths with depths, at low water, of two meters. In 2006, the Port of Cirebon handled about 3.3 million tons of cargo, including more imports than any other port in Indonesia. The Port of Cirebon was visited by 1957 vessels in 2006, 1600 of them bringing domestic bulk cargoes. The port’s major imported cargoes include coal, vegetable oils, and liquid asphalt. Major exports include tea, sugar, rice, and rattan furniture. The Port of Cirebon has a small container terminal and one passenger berth. The Port of Cirebon’s bulk coal terminal, with capacity to handle 50 thousand metric tons, supplies cement factories in the region. Although utilization rates are low, the terminal has capacity to unload 20 tons per hour. The Port of Cirebon has specialized terminals for asphalt and vegetable oils. Six tanks are devoted with capacity for 11.3 metric tons of asphalt. The vegetable oil facility covers 18 square kilometers and has storage capacity for 10.3 thousand metric tons. The Port of Cirebon’s passenger terminal is located next to the bulk cargo wharves. The passenger terminal covers 1.6 thousand square meters and serves a monthly service between Cirebon and Pontianak, Borneo, in West Kalimantan."
		},
		{
			"name": "Dumai, Sumatra",
			"country": "Indonesia",
			"description": "The Port of Dumai contains six berths a total 885 meters long. The cargo berth is 348 meters long with alongside depth of 9 meters. The multi-purpose berth is 400 meters long with alongside depth of 10 meters. The KPilot boat berth is 34 meters long with alongside depth of 6 meters. The Tug Boat berth is 8 meters long with alongside depth of 9 meters. The Ferry berth is 20 meters long with alongside depth of 2 meters, and the Pelra berth is 75 meters long with alongside depth of 3 meters."
		},
		{
			"name": "Jakarta",
			"country": "Indonesia",
			"description": "The Port of Jakarta contains twenty terminals devoted to general, dry bulk, liquid bulk, and containerized cargoes. Specialized terminals handle oil, chemicals, scrap, and passengers. The Port of Jakarta has quays of a total 16.8 thousand square meters in length with 76 berths. The Port of Jakarta also contains storage areas of 661.8 thousand square meters with capacity to store over 401.4 thousand tons of cargo."
		},
		{
			"name": "Jambi",
			"country": "Indonesia",
			"description": "The Port of Jambi (also known as the Port of Talang Duku) is the capital and the shipping and commercial center of Jambi province. Indonesia Port Corporation II (Indonesian) is the port authority responsible for facilitating traffic and handling of cargoes, maintaining port facilities, and supporting commercial activities within the port."
		},
		{
			"name": "Pontianak, Kalimantan",
			"country": "Indonesia",
			"description": "The Port of Pontianak covers 17.3 hectares. The Panjang Dermaga wharf is 1115 meters long with alongside depths from 4.7 to 6 meters. The port contains 47.1 thousand square meters of open yards and 11.2 thousand square meters of warehouse."
		},
		{
			"name": "Sunda Kelapa",
			"country": "Indonesia",
			"description": "The port authority responsible for the Port of Sunda Kelapa is the Indonesia Port Corporation II (Indonesian). The Port of Sunda Kelapa covers 50.8 hectares. It contains wharves that are three thousand meters long with alongside depth of four meters. The port includes 37.5 thousand square meters of open yards and 8.3 thousand square meters of warehouse. This old traditional port, which once handled all of Jakarta’s international trade, is a major tourist attraction today. Ships visiting the Port of Sunda Kelapa are inter-island and sailing cargo vessels carrying timber, building materials, and consumer products. The Port of Sunda Kelapa has become a commercial complex with offices, trade companies, industry, and hotels."
		},
		{
			"name": "Tanjung Priok",
			"country": "Indonesia",
			"description": "The Port of Tanjung Priok has three main container terminals that handled a total of 4.6 million TEUs of containerized cargo in 2010. The Port of Tanjung Priok's container terminals offer 13 berths with total length of 2800 meters (almost 9.2 thousand feet) with alongside depths from 9 to 14 meters (29.5 to 45.9 feet). The Jakarta International Container Terminal (JICT) has 2,350 meters of berths. JICT I has 1.8 thousand meters of berths with alongside depths of 11 and 14 meters (36 and 46 feet). JICT II has 516.6 meters of berths (1.7 thousand feet) with alongside depth of 9 meters (29.5 feet). In 2010, the JICT handled over two million TEUs of containerized cargo. The Port of Tanjung Priok's JICT is equipped with 21 container cranes, 62 transtainers, and 159 trucks and trailers. Its container yard covers 75 hectares. In February 2012, the JICT welcomed the largest vessel ever to enter the Port of Tanjung Priok. The Maersk Line's Diadema, 291.7 meters (957 feet) long with capacity for 4,546 TEUs, is scheduled to dock at the Port of Tanjung Priok's JICT on a weekly basis. It will serve the Brisbane-Jakarta-Singapore-Malaysia-Brisbane route. The Koja Container Terminal in the Port of Tanjung Priok has 650 meters (2.1 thousand feet) of berthing space with alongside depth of 14 meters (45.9 feet). In 2010, the Koja Terminal handled a total of almost 754.6 thousand TEUs of containerized cargo. The Koja Container Terminal in the Port of Tanjung Priok has six container cranes, 21 transtainers, 40 super-stackers, and 89 trucks and trailers. The Port of Tanjung Priok's MTI Container Terminal (Indonesian) handled over 1.7 million TEUs of containerized cargo in 2010. The MTI Container Terminal in the Port of Tanjung Priok is equipped with four container cranes, 11 transtainers, 20 forklifts, one top loader and one side loader, and 16 trucks and trailers. Its container yard covers just under 60 thousand square meters (or 14.8 acres). The Port of Tanjung Priok boasts two container freight stations covering a total of 164.5 hectares and three container yards covering 387 acres. The container freight stations include four acres of storage."
		},
		{
			"name": "Teluk Bayur",
			"country": "Indonesia",
			"description": "Port of Teluk Bayur covers 544 hectares of land and 30.9 hectares of port basin. It contains a wharf for conventional cargoes that is 740 meters long. The container wharf at the Port of Teluk Bayur is 222 meters long. A dedicated wharf is 583 meters long. The jetty oil wharf is 20 meters long. The Port of Teluk Bayur’s passenger terminal covers 1.6 thousand square meters and can accommodate two thousand people at the same time. All passenger traffic since 2004 has been inter-island movements."
		},
		{
			"name": "Johor",
			"country": "Malaysia",
			"description": "Johor Port’s JPB Bulk and Break Bulk Terminal has four berths totaling 537 meters for breakbulk cargoes. Two of the berths total 171 meters with alongside depth of 6.5 meters, and they can accommodate vessels of five thousand (Berth 9) and 20 thousand (Berth 10) DWT. Two of the Berths are 183 meters long each with alongside depth of 12.5 meters, and they can handle vessels to 30 thousand (Berth 11) and 65 thousand (Berth 12) DWT. Three dry bulk berths total 623 meters in length with alongside depth of 13.5 meters, and each can accommodate vessels to 60 thousand DWT. Johor Port also has six multi-purpose berths totaling 1130 meters in length with alongside depths from 11 to 13.8 meters. Accommodating vessels to 60 thousand DWT, Berths 7, 8, 9, and 10 are each 195 meters long with alongside depth of 13.8 meters. Berths 11S and 11N are 230 meters and 120 meters long, respectively, and each has alongside depth of 11 meters and can accommodate vessels to 10 thousand DWT. Johor Port contains 12 warehouses (including one transit shed) covering almost 111 thousand square meters to handle and store dry bulk and breakbulk cargoes. Johor Port also has eight open-sided storage sheds with a total of 54 thousand square meters and open yards of 65.6 thousand square meters to handle and store those cargoes. Johor Port contains 102.7 thousand square meters of warehouses to handle and store containerized cargoes."
		},
		{
			"name": "Kota Kinabalu",
			"country": "Malaysia",
			"description": "Kota Kinabalu Port contains about two thousand meters of berths at depths ranging from 5.5 to 10 meters. The Main Wharf 7 and Berths 1, 2, 3, 4, 5, 6, and 7 can accommodate vessels to 16 thousand DWT. With alongside depths ranging from 6.5 to 7.8 meters, the North Jetty and Berths 8 and 9 can accommodate vessels to 10 thousand DWT. Berths 10, 11, and 12 serve vessels to 6 thousand DWT and have alongside depths of from 5 to 8.5 meters. Kota Kinabalu Port has about storage facilities covering 66 thousand square meters. Three godowns cover 18.2 thousand square meters, while the Container Freight Station covers 4.5 thousand square meters. Kota Kinabalu Port also has an open storage yard of 26.8 thousand square meters, a timber yard of 16.5 thousand square meters, and 1550 container ground slots."
		},
		{
			"name": "Labuan",
			"country": "Malaysia",
			"description": "Labuan Port is a duty-free port with relaxed customs procedures. Being a small port, it can focus specialized services and equipment for efficient handling of cargoes, there is normally no wait for berthing and cargo discharging, and the port’s fees are among the lowest in Malaysia. Labuan Port’s berths have a total length of 355.6 meters with alongside depths of 4.6 and 10 meters. The New Liberty Wharf can accommodate vessels to 16 thousand DWT. There are also five private jetties in Labuan Port. The Shell Jetty, specializing in petroleum, is 213 meters long with alongside depth of 9.4 meters, and it can accommodate vessels to 6 thousand DWT. The Iron Ore Jetty can serve vessels to 150 thousand DWT. Specializing in iron ore cargoes, the jetty is 220 meters long with alongside depth of 18 meters. Specializing in methanol, the Methanol Jetty is 650 meters long with alongside depth of 13 meters. The Asian Supply Base Jetty is 120 meters long with alongside depth of 8 meters. Both it and the Sabah Flour Mill Jetty handle off-shore wheat and maize."
		},
		{
			"name": "Lumut",
			"country": "Malaysia",
			"description": "Lumut Port contains two terminals, Lumut Maritime Terminal and Lekir Bulk Terminal. The Lumut Maritime Terminal is a Malaysian Customs Gazetted Port designed to serve vessels of up to 35 thousand DWT at berths with alongside depth of 10 and 12 meters. Located on the banks of the Dindings River, the Lumut Maritime Terminal is a common-user facility covering about 33 hectares. Lumut Port’s Maritime Terminal has 480 meters of multi-purpose berth with alongside depth of 10 meters and can accommodate vessels to 35 thousand DWT. The terminal also has a barge berth of 54 meters with alongside depth of 3.5 meters that can serve two seven-thousand DWT barges at the same time. Pipelines connect the Lumut Port Maritime Terminal to the Lumut Port Industrial Park for the import and export of liquid bulk cargoes. Lumut Port’s Lekir Bulk Terminal is also a Malaysian Customs Gazetted Port. Designed to service Capemax-sized vessels over 180 thousand DWT, it has a natural water depth of 20 meters and can handle 12 million metric tons per year. The terminal is blessed with deep-water approaches and anchorage. The berth is 540 meters long and has a 45-meter mooring dolphin. Panamax vessels can berth on the landward side. The Lumut Port Lekir Bulk Terminal has 25 hectares of open storage for bulk cargoes of up to two million tons, and it has bulk unloading capacity for as much as 45 metric tons per day. The Lumut Port Lekir Bulk Terminal is a natural deep-water port. Southeast Asia’s biggest dry bulk unloading facility, it handles coal for the TNB Janamanjung power plant."
		},
		{
			"name": "Penang",
			"country": "Malaysia",
			"description": "In all, the Port of Penang contains five container terminals with 10 berths totaling 1673 meters in length with alongside depths ranging from 9 to 12 meters. The Port of Penang has over 200 thousand square meters of storage available, including almost 50 thousand square meters at the Butterworth Wharf. The Port of Penang's North Butterworth Container Terminal (NBCT) contains a 1500 meter (4.9 thousand foot) long wharf with alongside depth of 12 meters (39.4 feet). Covering land area of 42 hectares, the North Butterworth Container Terminal in the Port of Penang has capacity to handle two million TEUs per year. The berths at the Port of Penang's North Butterworth Container Terminal have berth storage capacity for 6600 thousand TEUs, and the container yard has 4400 TEU ground slots. The container freight station covers 2.1 acres and contains 360 reefer points for cold storage. The Port of Penang's NBCT is equipped with 13 gantry cranes with capacities of 35, 40, and 65 tons. It has 32 40-ton capacity rubber tyred gantry cranes, 60 prime movers, and 127 trailers. The Port of Penang's Butterworth Deep Water Wharves have two berths of 331 meters (1086 feet) with alongside depth of 9 meters (29.5 feet). Its container yard has ground slots for 1500 TEUs, and the terminal has two container freight stations covering a total of 2.9 acres with 50 reefer points for cold storage. The Butterworth Deep Water Wharves in the Port of Penang are equipped with 26 3-ton capacity forklifts, two ten-ton capacity forklifts, eight 16-ton capacity prime movers, and eight 16-ton capacity trailers. The container berths at the Port of Penang's Butterworth Deep Water Wharves are equipped with two gantry cranes (one 35-ton and one 40-ton), five rubber tyred gantry cranes (30.5- to 30.6-ton), one front end loader with capacity for up to 40 tons, ten three-ton forklifts, 49 trailers, nine 35.6-ton reach stackers, and 56 prime movers."
		},
		{
			"name": "Port Kelang",
			"country": "Malaysia",
			"description": "Port Klang has four container terminals with capacity to handle 8.4 million TEUs per year. The three terminals are equipped with ample cargo-handling equipment like post-Panamax quay cranes. Port Klang's Northport Container Terminal 1 has four berths for container vessels. Berth No. 8, at 213 meters (699 feet) long with alongside depth of 10.5 meters (34.4 feet), can accommodate vessels to 40 thousand DWT. With total length of 866 meters (2841 feet) and alongside depth of 13.2 meters (43.3 feet), Berths 9, 10, and 11 can handle ships to 60 thousand DWT. Port Klang's Northport Container Terminal 2 has five berths totaling 1.1 kilometers (1.8 miles) and can accommodate vessels to 80 thousand DWT. Each of the berths is 213 meters (699 feet) long with alongside depth of 13 meters (42.7 feet). Northport Container Terminal 3in Port Klang has three berths, each 178 meters (584 feet) long with alongside depth of 15 meters (15 feet) that can accommodate vessels to 120 thousand DWT. Port Klang's Westports Container Terminal has six berths, each of them 300 meters (984.2 feet) long with alongside depth of 15 meters (49.2 feet). Berths 7 and 8 can accommodate vessels to 80 thousand DWT, and Berths 9, 10, 11, and 12 can accommodate vessels to 115 thousand DWT."
		},
		{
			"name": "Sapanger Bay Oil Terminal",
			"country": "Malaysia",
			"description": "The Sepangar Bay Oil Terminal has two berths of 46 and 82 meters with alongside depth of 12.2 meters. The berths can accommodate vessels from one thousand to 30 thousand DWT. Sepangar Bay Oil Terminal has one godown storage facility of 700 square meters and open storage of 2.8 thousand square meters. Sepangar Bay Oil Terminal is equipped with nine common-user pipelines and five single-user pipelines."
		},
		{
			"name": "Tanjung Pelepas",
			"country": "Malaysia",
			"description": "Tanjung Pelepas Port has a total of 12 berths with a total wharf length of 4.3 kilometers (6.9 miles). Its 296-acre container yard offers storage space for 6.2 million TEUs, including 37.8 thousand ground slots and 4161 reefer connections. Forty-four post-Panamax quay cranes serve the Tanjung Pelepas Port berths. In addition, the berths are equipped with 138 rubber-tired gantry cranes, 274 prime movers, and 361 trailers. The master plan for the Tanjung Pelepas Port calls for 95 berths stretching from the Malaysia-Singapore Second Link to the mouth of the Pulai River offering a total handling capacity for 150 million TEUs. A state-of-the-art information technology system supports terminal operations and all port users. The IT system allows the flow of real-time information and reduces wasteful paperwork by facilitating electronic transactions. Pilotage is required within Tanjung Pelepas Port, and the port provides pilots around the clock all year. Tanjung Pelepas Port requires a minimum 7-day notification of estimated arrival time and a minimum three-hour notice for booking pilots for both entrance and exit of the port. Pilots will determine how many tugs will be required to assist cargo vessels in Tanjung Pelepas Port. All tugboats in Tanjung Pelepas Port have firefighting equipment and 3200 horsepower engines. Tanjung Pelepas Port rubber-tired gantry cranes have been fitted with SmartRail, a steering and positioning system guided by advanced satellite-guided position determination systems. Eliminating human errors associated with other global positioning systems, the SmartRail system increases accuracy and reduces misplaced containers. Advanced information technology systems are also used for container movements, container yard management, and vessel planning. The Gate Control and Monitoring System integrates gate operations with container management systems for greatest Tanjung Pelepas Port efficiency."
		},
		{
			"name": "Auckland",
			"country": "New Zealand",
			"description": "The Ports of Auckland's general wharves, with three kilometers of berths, are used for breakbulk cargoes that include timber, steel, liquid and dry bulk, vehicles, and containers. They include seven wharves, six of them near the Auckland central business district and one in Onehunga on the Manukau Harbour. Many vessels calling at the Ports of Auckland's general wharves carry cargoes to/from the Pacific Islands. Ports of Auckland manages the wharves and berths and contracts with stevedoring companies for cargo-handling services. The Ports of Auckland's Freyberg Wharf is a general-purpose wharf with 426 meters of berths and 5.8 hectares for handling cargoes that include containers, general cargo, fruit and vegetables, steel, dry bulk, and vehicle imports. Jellicoe Wharf, a general-purpose wharf, offers 670 meters of berths and 8.2 hectares for handling cargoes. Marsden Wharf in the Ports of Auckland has 398 meters of berths and one hectare for handling imported vehicles. Captain Cook Wharf, also dedicated to imported vehicles, contains 478 meters of berths and 2.2 hectares for cargo-handling. Queens Wharf, used for the import of vehicles, timber, fruit and vegetables, is also the back-up berth for cruise ships. It offers 516 meters of berths, 3 hectares for cargo-handling, and 2300 square meters of cool storage. Wynard Wharf is a deep-water Ports of Auckland facility specializing in bulk liquid cargo including chemicals, minerals, fish, vegetable oils, bulk sand, petroleum products, and general cargo. It offers 486 meters of berths and one hectare of operating area. The Ports of Auckland contains two world-class terminals for containers. Each terminal has ample cargo-handling equipment and state-of-the-art container tracking systems. They are both open 24 hours a day throughout the year. The Ports of Auckland are complemented by inland port at Wiri by on-site railway, giving customers many options for receiving and delivering goods. In proximity to Auckland's central business district, the Ports of Auckland container terminals have easy access to 33% of the country's consumers. New Zealand's biggest and most advanced container terminal is the Fergusson Container Terminal. This Ports of Auckland terminal covers 32 hectares and contains 610 meters of berths. Equipped with five post-Panamax ship-to-shore cranes, the Ports of Auckland is planning a 3.6-hectare expansion to the terminal and the addition of a third berth by 2016. The Bledisloe Container Terminal in the Ports of Auckland covers 14.5 hectares, and it offers services for vessels needing quick-turn around and for refrigerated containers. With 260 meters of berths, this Ports of Auckland container terminal also offers a third container ship berth, meaning that the Ports of Auckland can service more container ships at the same time than can any other port in New Zealand. Axis Pack provides specialized services for exports. It offers 8000 square meters for storing dry export cargo like timber and paper products."
		},
		{
			"name": "Lyttelton",
			"country": "New Zealand",
			"description": "The Port of Lyttelton has gone through many changes over time to remain competitive and adapt to the ever-changing nature of ocean-going commerce. Moles have been built to protect ships from the harbor winds. Land has been reclaimed to make cargo-handling areas. The Port of Lyttelton Container Port was established to take advantage of the new age of containerization. The Port of Lyttelton is South Island’s biggest and busiest commercial deep-water port. A hub for South Island’s container traffic, it is strategically positioned to distribute both national and international cargoes. Many international shipping lines call at the Port of Lyttelton on a regular basis."
		},
		{
			"name": "Napier",
			"country": "New Zealand",
			"description": "Port of Napier is fully-equipped to handle all types of cargoes. It is open for business 24 hours a day, 365 days a year. The Container Terminal focuses on refrigerated products, although it handles all kinds of cargo. The Port of Napier also has facilities to handle non-containerized cargoes like logs, cement, bulk liquids, woodchips, oil products, fertilizers, vehicles, forestry products, and foodstuffs. The central cargo-warehousing area is called Port Pack, affording ship-side packing and presenting services to its customers with covered all-weather packing areas. The Port of Napier’s Wharf No. 1 is a log-loading berth with a 4.15 hectare reclamation area for storage located behind the berth. Pan Pac Forest Products operates a woodchip facility at the Port of Napier with a stockpile yard of about 1.2 hectares. The liquid bulk wharves at the Port of Napier handle tallow and edible oils. The wharves are connected to storage areas by heated pipelines with a load-out rate of 350 tons per hour. With direct road and rail connections, the tank farm operated by Pacific Terminals Ltd. has capacity to store 6450 tons, and drumming facilities are available. The Port of Napier’s petroleum wharves are connected to storage tanks by pipelines. The port company provides safety fence and tanker watchmen, and independent oil companies located in Ahuriri, Napier operate the wharves. The bitumen discharge point for the Port of Napier is at Wharf 2 South, which has capacity to store five thousand tons in tanks that are operated by Belspray Bitument. The wharf is equipped for direct load-out to both road and rail."
		},
		{
			"name": "Port Chalmers",
			"country": "New Zealand",
			"description": "The Port Otago container facility includes 15 hectares of paved area with capacity to store more than four thousand containers. The facility also has a wash pad that can handle 72 dry or reefer containers and the most reefer points of any port in New Zealand. With three cranes, Port Otago can handle two ships at the same time. Port Otago contains more than 32.6 thousand square meters of covered on-wharf warehouses that receive cargo for packaging/unitizing, palletizing, and labeling. The dry goods warehouses are adjacent to the container berths, and the docks have excellent road and rail access to the warehouses. Port Otago includes an all-weather load-out bay and container vanning for all kinds of export products. Port Otago operates a computerized inventory management system to keep track of and manage container traffic. The Dunedin Wharves have on-wharf facilities to food standard where both imports and exports can be warehoused. Port Otago’s Port Chalmers handles conventional, multi-purpose, roll-on/roll-off, and container vessels. The basin is dredged to 128 meters, and it has a 700-meter diameter turning basin. The Dunedin Wharf system serves vessels with lower draft of 8 meters and no more than 150 meters long, primarily tankers, smaller conventional vessels, and fishing boats. Vessels over 150 meters can transit only in daylight. Port Otago’s Dunedin Wharves are located less than two kilometers from cold storage facilities that store meat, dairy, fishing, and horticultural exports from the Otago Region. The Ravensbourne Fertilizer Pier is located between Dunedin and Port Chalmers. Port Otago contains eight piers. The Oil Jetty is 220 meters long with alongside depth of 8 meters. The Liquefied Petroleum Gas Berth is 62 meters long with alongside depth of 5.7 meters. Specializing in roll-on/roll-off cargoes, the Leith Wharf is 153 meters long with alongside depth of 7.4 meters. Port Otago’s Victoria Wharf contains four berths with alongside depth of 8 meters. Berths T and U are 176 meters long. Berths X and Y are 245 meters long. The Rattray Pier is 435 meters long with alongside depth of 5 meters. The Birch Street Pier is 310 meters long with alongside depth of 7 meters, and the Ravensbourne Pier is 150 meters long with alongside depth of 7 meters."
		},
		{
			"name": "Tauranga",
			"country": "New Zealand",
			"description": "The Port of Tauranga’s channel offers maximum draft from 11.7 (low water) and 13 meters (high water). Cargo is moved by dedicated rail and road access from the terminal which covers about 78 hectares. In total, the Mount Maunganui wharf is over two thousand meters long, and the Sulphur Point wharf is 600 meters long. Both can accommodate vessels to 290 meters. With 337 reefer points, Mount Maunganui has a 21.6 thousand square meters of dry cargo storage area, 22.5 thousand square meters of cold stores, and 3.7 thousand square meters for general cargo and perishables. With 1010 reefer points, Sulphur Point has 22.5 thousand square meters for storage of dry cargoes and 7.2 thousand square meters of cold storage. Off-wharf storage can accommodate up to 115 thousand tons of petroleum products and 2.3 thousand tons of cement."
		},
		{
			"name": "Westport",
			"country": "New Zealand",
			"description": "The Port of Westport can accommodate vessels to 131 meters in length with a 25-meter beam; however, vessels should contact the harbormaster before attempting to cross the bar. The Port of Westport uses the tug/pilot vessel Bob Gower to assist vessels entering the port. The Port of Westport contains 20 thousand square meters of flat storage area. It is equipped with an electric travelling crane with a 17-meter radius that can lift 12.2 metric tons of cargo. The port also has mobile cranes available."
		},
		{
			"name": "Wellington",
			"country": "New Zealand",
			"description": "The Port of Wellington Container Terminal has two berths of 293 meters in length that can accommodate vessels with 11 meters (Berth 1) and 10.7 meters (Berth 2) draft. There is no limit on the length of vessels using the berths. The terminal can accommodate 2200 TEUs and has capacity for 800 refrigerated containers. Since the early 1970s when the CentrePort container terminal was inaugurated, the Port of Wellington has had one of the best refrigerated cargo-handling facilities in the country. Cargo is monitored 24 hours a day, and CentrePort has implemented procedures for handling chilled cargoes. The terminal is served by two rail lines, each with capacity to hold 18 wagons. The Container Terminal also handles breakbulk and project cargoes that include yachts, transformers, heavy machinery, and heavy lifts. The Container Depot at the Port of Wellington is operated by Transport Systems 2000 Limited, a joint venture between United Containers Limited and CentrePort. The rail siding has capacity for 60 wagons carrying 120 TEUs. The Depot contains 2.5 hectares of storage capacity for 3000 TEUs. The facilities include space for covered repairs, washing facilities for 180 TEUs, and a reefer pre-trip facility for 68 TEUs."
		},
		{
			"name": "Karachi",
			"country": "Pakistan",
			"description": "Of the 30 dry cargo berths in the Port of Karachi, 13 are located on the West Wharves, 17 are on the East Wharves. The Port of Karachi also has three berths for liquid cargo that includes petroleum and non-petroleum products. The Port of Karachi also has two container terminals operated by the private sector. In addition, the Port of Karachi has ample support facilities and systems for cargo transit, storage, and clearance that include ample rail and road service. The shipyard covers 29 hectares, and its facilities include a large hall and three berths, two dry docks, and three foundries (iron, steel, and non-ferrous). The shipyard is used to build and repair both commercial and military vessels. The shipyard also has fabrication ships, a machine shop, and supporting facilities for carpentry, pipe fitting, and light steel fabrication. The Port of Karachi shipyard has produced over 434 cargo ships, tugboats, support vessels, naval vessels, and submarines. It has also repaired some five thousand vessels and built more than two thousand heavy engineering units. The shipyard in the Port of Karachi has capacity to build and repair medium-sized ships to 18 thousand DWT and multi-purpose cargo vessels to 26 thousand DWT. The Port of Karachi Shipyard has three building berths, two dry docks and the ability to fabricate three ships while also repairing four major ships at the same time. This shipyard in the Port of Karachi builds naval ships like frigates, corvettes, missile craft, gunboats, assault boats, patrol craft, ammunition carriers, oil and water tankers, diving boats, and submarines. The shipyard's Heavy and General Engineering section undertakes a wide variety of mechanical and hydraulic structural works. It has also produced all kinds of cranes, industrial boilers, storage tanks, and pressure vessels as well as all types of castings and complete sugar plants. The Port of Karachi Shipyard also built a dredger for a firm in Belgium that included the entire complement of dredging support vessels including tugboat, workboat, and barges. Recently, the shipyard constructed two 40-ton bollard pull ocean-going tugs for one of its most important customers, the Port Qasim Authority."
		},
		{
			"name": "Muhamamad Bin Qasim",
			"country": "Pakistan",
			"description": "Vessels approach Port Muhammad Bin Qasim through a 45-kilometer Navigation Channel that can accommodate vessels to 75 thousand DWT. Tidal variation at Port Muhammad Bin Qasim ranges from 0.5 to 3.5 meters. One of Port Muhammad Bin Qasim’s advantages its location near the national highway network (the National Highway is 15 kilometers away), the rail network (the National Railway is 14 kilometers away), and air transport (22 kilometers from Jinnah International Airport). The National Railway has six tracks immediately behind the berths. Muhammad Bin Qasim is an integrated port handling ocean-borne trade with warehouse facilities. It also provides land and facilities to support the growth of port-based industry and commerce. Port facilities have been constructed by both public and private interests."
		}
	]
}
